[
	{
		"perex": "<p>The venture capital fund DBG Osteuropa- Holding has completed the sale of the Internet provider Czech On Line to the telecommunication operator Telekom Austria. Jaroslav Horák, Managing Director of DBG Eastern Europe, has informed about the transaction today.</p>",
		"title": "DBG Fund sold Czech On Line at a record price",
		"date": "2000-07-17T00:00:00.000Z",
		"originalUrl": "https://www.arxequity.com/5-2/",
		"image": null,
		"body": "<p>The venture capital fund DBG Osteuropa- Holding has completed the sale of the Internet provider Czech On Line to the telecommunication operator Telekom Austria. Jaroslav Horák, Managing Director of DBG Eastern Europe, has informed about the transaction today.</p>\n<p>„DBG Osteuropa- Holding signed the contract for sale of Czech On Line to Telekom Austria on April 12 of this year. The standard buyer’s audits and usual approval procedures by the anti-monopoly authorities in the Czech Republic and Austria had to be finalized before the transaction could be completed,” announced Jaroslav Horák.</p>\n<p>The price paid for the largest domestic Internet provider has reached an impressive US$ 220 million or nearly CZK 8.5 billion. It has been so far the largest Internet related transaction in the Central / Eastern European region. The Czech Republic has thus proved to be one of the prominent European countries from the point of view of output and potentials of the ‘New Economy’. „We are glad to have made the investment in the Czech Republic. It has confirmed our view that Czech Republic has a great potential for valorization of investments into Internet business,” said Jaroslav Horák of DBG.</p>\n<p>Czech On Line, operating under the name Video On Line, was established in 1995. It was acquired by DBG Osteuropa- Holding in August 1998. One year later it became the first Czech ISP to offer free Internet connection service under the name VOLny.cz. It was the very first business model of this kind implemented in a country where liberalization of telecommunications has not yet taken place. Czech On Line is currently the largest domestic Internet provider which, according to independent experts’ estimates, controls more than one third of the Czech market.</p>\n<p>„We highly appreciate our collaboration with the DBG Fund. Since their acquisition of the company, Czech On Line has strengthened its position of provider of innovative Internet and telecommunication services and products. The successful introduction of free Internet access represented a milestone from the point of view of increased availability of Internet access for the Czech users,“ said Mariano Pireddu, Chief Executive Officer of Czech On Line.</p>\n",
		"updatedAt": "2020-08-30T07:28:47.827Z"
	},
	{
		"perex": "<p>DBG Eastern Europe’s second Central and Eastern European-focused private equity fund has completed a first closing at € 67 M. The fund’s second close will be completed later in the year, with targeted total commitments of € 80 M. DBG Eastern Europe II LP is the successor fund to the highly successful DBG Osteuropa-Holding GmbH, which has already returned nearly four times its original investor commitments. The first close of DBG Eastern Europe II LP has been completed with the unanimous backing of the predecessor fund’s limited partners: Deutsche Bank, EBRD, Mitsubishi Corporation and DEG.</p>",
		"title": "DBG Eastern Europe Announces first close of fund II",
		"date": "2003-01-28T00:00:00.000Z",
		"originalUrl": "https://www.arxequity.com/arx-equity-partners-acquires-slovenian-healthcare-provider/",
		"image": null,
		"body": "<p>DBG Eastern Europe’s second Central and Eastern European-focused private equity fund has completed a first closing at € 67 M. The fund’s second close will be completed later in the year, with targeted total commitments of € 80 M. DBG Eastern Europe II LP is the successor fund to the highly successful DBG Osteuropa-Holding GmbH, which has already returned nearly four times its original investor commitments. The first close of DBG Eastern Europe II LP has been completed with the unanimous backing of the predecessor fund’s limited partners: Deutsche Bank, EBRD, Mitsubishi Corporation and DEG.</p>\n<p>The Central and Eastern European-focused private equity firm was established in 1996 with the support of German middle market buy-out firm, Deutsche Beteiligungs AG. The firm’s partners will maintain their relationship with Deutsche Beteiligungs AG, while operating from an established network of offices in Budapest, Prague and Warsaw.</p>\n<p>DBG Eastern Europe’s strategy remains consistent, with a focus on later stage investments such as expansion financing, management buy-outs and buy-ins and industry consolidation transactions. The fund will primarily target the core EU accession countries of Czech Republic, Hungary and Poland, with a secondary focus on Croatia, Slovakia, Slovenia, South Eastern Europe and the Baltic Republics.</p>\n",
		"updatedAt": "2020-08-30T07:28:47.904Z"
	},
	{
		"perex": "<p>DBG Eastern Europe’s second Central and Eastern European – focused private equity fund has completed its first investment.</p>",
		"title": "Management buy out of Ergis",
		"date": "2003-08-27T00:00:00.000Z",
		"originalUrl": "https://www.arxequity.com/arx-equity-partners-acquires-slovenian-healthcare-provider-2/",
		"image": null,
		"body": "<p>DBG Eastern Europe’s second Central and Eastern European – focused private equity fund has completed its first investment.</p>\n<p>DBG with Polish managers Tadeusz Nowicki and Marek Górski, through a holding vehicle Finergis, have acquired Ergis S.A. shares from several National Investment Funds and placed an offer to buy the remaining shares from the Polish State Treasury.</p>\n<p>Ergis S.A. that had participated in the mass privatization program since 1994 is the only Polish manufacturer of pharmaceutical foils and of wallcoverings and is the leading producer of PVC isolation foils, packaging and office foils and of construction panels in Eastern Central Europe. Following several mergers, take-overs and development investments that took place in the years 1998-2001 sales of Ergis Group have more than doubled to reach over € 50 M in the current year.</p>\n<p>DBG Eastern Europe II LP is the successor fund to the highly successful DBG Osteuropa-Holding GmbH that had been investing in Poland, Czech Republic, Slovakia and in Hungary from 1997.</p>\n<p>DBG Eastern Europe is focused on later stage investments. Ergis follows DBG’s earlier investments financing management buy outs of Czech on Line and Hungarocamion.</p>\n<p>„We believe that management buy outs of Polish industrial companies will be interesting for private equity funds in the next few years. Co-operation with Ergis management will allow us to benefit from expected development of the Company in result of Polish accession to European Union and from its intensive modernization program implemented in the last few years.” said Jacek Korpala, managing director of DBG Eastern Europe.</p>\n<p>„I am confident that the buy out worked out by DBG and the managers will be a strong basis for long term development of the Ergis Group and will be an example to follow by other Polish middle size industrial groups.” said Tadeusz Nowicki, the CEO of Ergis S.A.</p>\n",
		"updatedAt": "2020-08-30T07:28:47.811Z"
	},
	{
		"perex": "<p>Flamingo International has signed on 11th of January 2006, with Flanco Holding, the agreement for the acquisition of Flanco International SRL, one of the most important retailers of consumer electronics and white goods in Romania. The total transaction value will amount to approximately € 37 M. The Flamingo Group will thus become the second largest Romanian retailer of IT products, consumer electronics and white goods in terms of sales.</p>",
		"title": "DBG exchanges its participation in Flanco for shares in Flamingo",
		"date": "2006-01-11T00:00:00.000Z",
		"originalUrl": "https://www.arxequity.com/3-2/",
		"image": null,
		"body": "<p>Flamingo International has signed on 11th of January 2006, with Flanco Holding, the agreement for the acquisition of Flanco International SRL, one of the most important retailers of consumer electronics and white goods in Romania. The total transaction value will amount to approximately € 37 M. The Flamingo Group will thus become the second largest Romanian retailer of IT products, consumer electronics and white goods in terms of sales.</p>\n<p>„We have closed this deal because size matters on this market and we want to further develop our company, rapidly and effectively. By joining forces with Flanco, we now become no.1 on the retail market in terms of the number of stores and no. 2 in terms of sales volumes” said Dragos Cinca, President of Flamingo International. The deal will be done in cash. Flamingo will finance the acquisition through an issue of 316.9 million new shares at a price per share of RON 0.4370. The issue will address the existing Flamingo shareholders, who will have preference rights. The preference rights will be traded on the BSE. Flanco Holding intends to acquire preference rights and subscribe up to two thirds of the new share issue. The transaction will be subject to approval by the Flamingo General Shareholders’ Meeting and The Competition Council.</p>\n<p>„Following the closing of this transaction, we anticipate that the Flamingo group shall accelerate growth and increase profitability in the context of an increasingly competitive retail market. The acquisition of Flanco brings to market a retail group with an expected turnover in excess of € 200 M in the first year after the closing of the transaction. We expect this transaction to result in substantial reductions in operating costs, especially in the purchases of IT and consumer electronics, but also in other areas such as marketing, distribution and SG&amp;A”, stated Dragos Cinca.</p>\n<p>The group that results out of this transaction will have 199 stores all over the country and a strong presence in the segment of medium-area shops (150-300 sqm). The company shall diversify, via a safer route, into the segment of large-area shops 2 to 3 years earlier than anticipated at the moment of the Flamingo’s IPO. „We expect that the combination of the three major product portfolios (IT, consumer electronics and white goods) will generate the appropriate client numbers for the profitable operation of large area stores (2000-5000 sqm). For the next 12-18 months, Flamingo’s expansion strategy shall focus on the development of 10 new large-surface locations under the Flanco World brand. After closing the deal, both Flamingo and Flanco brands will be kept as such”, mentioned Dragos Cinca.</p>\n<p>Shareholders of Flanco are Oresa Ventures, DBG Eastern Europe II LP and Florin Andronescu.</p>\n",
		"updatedAt": "2020-08-30T07:28:47.899Z"
	},
	{
		"perex": "<p>Czech specialized electric motors manufacturer, VUES Brno a.s. (“VUES”), has been acquired by DBG Eastern Europe II, LP (“DBG”). On April 26, 2006, DBG completed an LBO of a 80% shareholding in VUES through takeover of VUES’ parent ES Brno, s.r.o. Two members of the VUES senior management team have partnered with DBG in the transaction. The transaction size was not disclosed.</p>",
		"title": "DBG acquires controlling interest in VUES Brno",
		"date": "2006-04-26T00:00:00.000Z",
		"originalUrl": "https://www.arxequity.com/4-2/",
		"image": null,
		"body": "<p>Czech specialized electric motors manufacturer, VUES Brno a.s. (“VUES”), has been acquired by DBG Eastern Europe II, LP (“DBG”). On April 26, 2006, DBG completed an LBO of a 80% shareholding in VUES through takeover of VUES’ parent ES Brno, s.r.o. Two members of the VUES senior management team have partnered with DBG in the transaction. The transaction size was not disclosed.</p>\n<p>VUES, a former electrical machines research institute, is a Czech design, development and production company with focus on high-quality electric motors made to custom specifications. VUES’ clients further integrate its motors into equipment for industries such as robotics, logistics and packaging, electronic assembly, automotive industry, energy or traction.</p>\n<p>„We were impressed by the achievements of VUES, which over the past 15 years evolved from a research institute into a dynamic and successful commercial organization while keeping and further developing its technical competence. We have invested in the company with a view to further expand VUES’ position in the industry, primarily through organic growth,” said Jaroslav Horak, a Partner at DBG.</p>\n<p>Jiri Havelka, General Manager of VUES stated, „We will continue to develop and supply high-quality products for European markets. With the backing of a strong financial investor we intend to increase the range of our customers and further expand our market position.”</p>\n",
		"updatedAt": "2020-08-30T07:28:47.834Z"
	},
	{
		"perex": "<p>Finergis lnvestments, the holding company controlled by DBG Eastern Europe II, LP (“DBG”) has sold its 17% minority shareholding in Eurofilms SA, one of the largest producers of stretch films in Poland, during its recent IPO.</p>",
		"title": "DBG has indirectly sold its 17% shareholding in Eurofilms during its IPO",
		"date": "2006-06-07T00:00:00.000Z",
		"originalUrl": "https://www.arxequity.com/dbg-has-indirectly-sold-its-17-shareholding-in-eurofilms-during-its-ipo/",
		"image": null,
		"body": "<p>Finergis lnvestments, the holding company controlled by DBG Eastern Europe II, LP (“DBG”) has sold its 17% minority shareholding in Eurofilms SA, one of the largest producers of stretch films in Poland, during its recent IPO.</p>\n<p>On June 6, 2006, the management of Eurofilms announced that the IPO of Eurofilms was a great success. Private investors subscribed for over five times more shares than were offered. New shares issued brought Eurofilms over PLN 16 M in new capital. Eurofilms plans to use this money to finance capital investments in order to significantly increase its production of stretch and PVC thermoshrink films. In addition to the newly issued shares were also sold by the existing shareholders: (i) Ergis, disposed of only a small part of its shares, thus it shall keep a majority shareholding in Eurofilms post IPO; and (ii) Finergis lnvestments sold all of its shares.</p>\n<p>DBG’s partial exit of Eurofilms follows it’s partial exit of Flanco, a leading Romanian electrical retailer, to the largest Romanian IT retailer and distributor, Flamingo in early May. Flamingo is listed on the Bucharest Stock Exchange. DBG has retained a significant indirect stake in Flamingo.\nJacek Korpala, a Partner at DBG stated, „We are happy that stock exchange investors shared our positive view and belief about future prospects of the Company. Although DBG has indirectly sold its minority shareholding in Eurofilms, we are still majority shareholder in Ergis (through Finergis Investments), which controls Eurofilms. We are convinced that Eurofilms is capable to grow export sales and strengthen its position on the Polish market. We hope that Eurofilms shall be a successful investment for both existing and new shareholders.”</p>\n",
		"updatedAt": "2020-08-30T07:28:47.825Z"
	},
	{
		"perex": "<p>Komex Sp. z o.o. (“Komex” or “the Company”) – a chain of retail stores offering children clothing under the brand name “5.10.15” has been acquired by DBG Eastern Europe II LP (“DBG”) and 3TS Central European Fund II (“3TS”).</p>",
		"title": "DBG and 3TS acquire controlling interest in Polish children’s clothing retailer Komex",
		"date": "2006-08-17T00:00:00.000Z",
		"originalUrl": "https://www.arxequity.com/dbg-and-3ts-acquire-controlling-interest-in-polish-childrens-clothing-retailer-komex/",
		"image": null,
		"body": "<p>Komex Sp. z o.o. (“Komex” or “the Company”) – a chain of retail stores offering children clothing under the brand name “5.10.15” has been acquired by DBG Eastern Europe II LP (“DBG”) and 3TS Central European Fund II (“3TS”).</p>\n<p>On 17 August 2006 DBG and 3TS completed a transaction acquiring a majority shareholding in Komex. The Company is the operator of over 50 stores under the brand name “5.10.15”. Komex is one of the largest retail chains of stores in Poland offering exclusively children’s clothing. DBG and 3TS acquired shares from the existing shareholder and increased capital to finance further expansion.</p>\n<p>Jacek Korpala, a Partner at DBG and Zbigniew Łapiński, 3TS Director stated, „We are impressed by Komex’s development over the last few years, which transformed the Company from small retailer to a significant player in its market segment. We believe that Komex is well positioned to maintain its high growth in the future through continued expansion of its presence in the larger Polish cities at the same time retaining a high quality of products offered.</p>\n",
		"updatedAt": "2020-08-30T07:28:47.804Z"
	},
	{
		"perex": "<p>Merger of companies controlled by DBG Eastern Europe II LP: Ergis S.A. and Eurofilms S.A. (the latter quoted on the Warsaw Stock Exchange) is a fact. The Court registered the merger on 29 June. In effect it was created one of the largest plastic processing companies in Central Eastern Europe, with the total annual net revenue surpassing PLN 390 M.</p>",
		"title": "Companies controlled by DBG merged: Erigs S.A. and Eurofilms S.A",
		"date": "2007-07-02T00:00:00.000Z",
		"originalUrl": "https://www.arxequity.com/companies-controlled-by-dbg-merged-erigs-s-a-and-eurofilms-s-a/",
		"image": null,
		"body": "<p>Merger of companies controlled by DBG Eastern Europe II LP: Ergis S.A. and Eurofilms S.A. (the latter quoted on the Warsaw Stock Exchange) is a fact. The Court registered the merger on 29 June. In effect it was created one of the largest plastic processing companies in Central Eastern Europe, with the total annual net revenue surpassing PLN 390 M.</p>\n<p>On 29 June 2007, the Warsaw District Court registered the merger of Eurofilms S.A., the leading manufacturer of stretch films in Poland, producer of thermo-shrinking PVC films and distributor of BOPP films and PET tapes, with the Company’s majority shareholder – Ergis S.A. – the largest in Poland and the leading in Central Eastern Europe manufacturer of PVC based products (films, compounds, wallpapers, wall panels and windowsills). The merger was approved by shareholders of Eurofilms and of Ergis at their respective general meetings in May. The new entity is operating under the name Ergis-Eurofilms S.A. The leading shareholder of the merged entity is Finergis Investments Ltd, which in turn is controlled by DBG Eastern Europe II LP.</p>\n<p>Strategic development objective of the merged companies is to strengthen its leading position in manufacturing of films and processing plastic in Central Eastern Europe.</p>\n<p>Jacek Korpala, Partner at DBG, said: „We are glad that it was possible to effect the merger efficiently, fast and with support of the companies’ shareholders. We are looking forward for further fast development of the merged companies, both organically and through acquisitions. We believe that Ergis-Eurofilms S.A. will be a fruitful investment for all of its shareholders.”</p>\n",
		"updatedAt": "2020-08-30T09:27:42.162Z"
	},
	{
		"perex": "<p>Slovenian plastic components producer, Tomplast d.o.o., has been acquired by DBG Eastern Europe II, LP (“DBG”). Tomplast is one of Slovenia’s leading manufacturers of plastic-moulded components.</p>",
		"title": "DBG acquires controlling interest in Slovenian plastic components producer Tomplast",
		"date": "2007-07-06T00:00:00.000Z",
		"originalUrl": "https://www.arxequity.com/dbg-acquires-controlling-interest-in-slovenian-plastic-components-producer-tomplast/",
		"image": null,
		"body": "<p>Slovenian plastic components producer, Tomplast d.o.o., has been acquired by DBG Eastern Europe II, LP (“DBG”). Tomplast is one of Slovenia’s leading manufacturers of plastic-moulded components.</p>\n<p>On July 6, 2007, DBG completed an MBI of a 100% shareholding in Tomplast d.o.o. The acquisition of Tomplast is DBG’s second Slovenian manufacturing buy-out investment in the past two years.</p>\n<p>Tomplast is a Slovenian manufacturing company, with a primary strategic focus as a supplier of plastic components mainly to the automotive industry. The MBI team that has partnered with DBG in the Tomplast acquisition is led by Mark Stemberger. DBG and Mr. Stemberger intend to grow Tomplast in the coming years organically and potentially via acquisitions. The transaction size was not disclosed.</p>\n",
		"updatedAt": "2020-08-30T07:28:47.854Z"
	},
	{
		"perex": "<p>Axon Leasing and Financial Zrt. (“Axon” or the “Company”), the largest non-bank-owned leasing company in Hungary announced today that it has received equity funding from ARX (formerly branded as DBG Eastern Europe), a mid-market focused CEE private equity firm and 3i, the London FTS100 private equity fund, who acted through 3TS Capital Partners in the transaction. The investment was made through a Cyprus-domiciled investment vehicle. The investment, containing both a stock purchase as well as a substantial contribution to Axon’s share capital, totals € 9 M. In addition to this amount, the private equity investors earmarked € 6 million for further expansion in the future.</p>",
		"title": "Axon Leasing and Finance Zrt. Attracts blue-chip investors",
		"date": "2008-02-07T00:00:00.000Z",
		"originalUrl": "https://www.arxequity.com/axon-leasing-and-finance-zrt-attracts-blue-chip-investors/",
		"image": null,
		"body": "<p>Axon Leasing and Financial Zrt. (“Axon” or the “Company”), the largest non-bank-owned leasing company in Hungary announced today that it has received equity funding from ARX (formerly branded as DBG Eastern Europe), a mid-market focused CEE private equity firm and 3i, the London FTS100 private equity fund, who acted through 3TS Capital Partners in the transaction. The investment was made through a Cyprus-domiciled investment vehicle. The investment, containing both a stock purchase as well as a substantial contribution to Axon’s share capital, totals € 9 M. In addition to this amount, the private equity investors earmarked € 6 million for further expansion in the future.</p>\n<p>Axon maintains a solid market position in certain well-defined segments of the leasing market such as the financing of commercial vehicles, machinery and boats. Axon was founded in 1991, and currently ranks among the Top 10 Hungarian leasing companies in truck leasing; is also strong in equipment leasing; and is the market leader in a niche segment: boat leasing. Axon is active in both financial and operational leasing. Axon expects to finance new leasing assets of around € 40 M in 2007 and has a leasing portfolio of € 75 M.</p>\n<p>Axon’s core customer focus is the SME market segment, which tends to be under-funded, due to the fact that many SMEs have limited collateral to secure bank loans. Therefore, leasing should assist in driving the growth of the SME segment in Hungary. The current ARX / 3i equity infusion will propel Axon through its next phase of growth and expansion. The new funding will enable Axon to expand into new geographic and product areas. Axon will strengthen its market presence in Western Hungary and is planning to expand into Romania and possibly Serbia or Croatia. Axon sees great potential in its recently launched new division focusing on real estate leasing.</p>\n<p>„As an independent leasing company you need to provide superior, value-added service to clients in order to be able to compete with the bank owned leasing firms. Our people are Axon’s greatest assets and we are constantly looking for new talent and experienced professionals. We are very happy to have found such partners as ATX/3i/3TS who are not only committed to support us with funding but also help the development with other important business aspects” – stated Zoltan Kun, Founder &amp; CEO of Axon.</p>\n",
		"updatedAt": "2020-08-30T07:28:47.863Z"
	},
	{
		"perex": "<p>Funds managed by Arx Equity Partners (“ARX”) supported Tomplast d.o.o., a Slovenian plastic components producer, to perform an add-on acquisition of Unitplast d.o.o..</p>",
		"title": "ARX supports its portfolio company Tomplast in the add-on acquisition of Unitplast",
		"date": "2008-04-05T00:00:00.000Z",
		"originalUrl": "https://www.arxequity.com/arx-supports-its-portfolio-company-tomplast-in-the-add-on-acquisition-of-unitplast/",
		"image": null,
		"body": "<p>Funds managed by Arx Equity Partners (“ARX”) supported Tomplast d.o.o., a Slovenian plastic components producer, to perform an add-on acquisition of Unitplast d.o.o..</p>\n<p>On April 25, 2008, Tomplast, backed by ARX, completed the add-on acquisition of a 100% ownership interest in Unitplast. ARX has held a controlling stake in Tomplast since July 2007, when the company was acquired in partnership with Mr. Mark Stemberger in a management buy-in transaction.</p>\n<p>Tomplast is a Slovenian manufacturing company, which acts primarily as a tier two supplier of plastic components for the automotive and leisure industries.</p>\n<p>Unitplast is a producer of rubber and plastic components located in Semič, Slovenia. On a pro-forma basis the acquisition of Unitplast will more than double Tomplast’s 2008 revenues.</p>\n",
		"updatedAt": "2020-08-30T07:28:47.919Z"
	},
	{
		"perex": "<p>Arx Equity Partners (“ARX”) held the first close of its third dedicated Central and Eastern Europe focused lower mid-market fund at € 83 million. ARX is targeting € 125 million for the fund’s final close. ARX III’s largest first close commitments came from the European Bank for Reconstruction and Development, the European Investment Fund and Alpha CEE II (a fund managed by Alpha Associates).</p>",
		"title": "ARX holds first close of ARX CEE III LP",
		"date": "2008-09-20T00:00:00.000Z",
		"originalUrl": "https://www.arxequity.com/arx-holds-first-close-of-arx-cee-iii-lp/",
		"image": null,
		"body": "<p>Arx Equity Partners (“ARX”) held the first close of its third dedicated Central and Eastern Europe focused lower mid-market fund at € 83 million. ARX is targeting € 125 million for the fund’s final close. ARX III’s largest first close commitments came from the European Bank for Reconstruction and Development, the European Investment Fund and Alpha CEE II (a fund managed by Alpha Associates).</p>\n<p>ARX III is the successor fund to DBG Eastern Europe II LP. DBG Eastern Europe rebranded as ARX and became fully independent in early 2008.</p>\n<p>The ARX team of eight professionals is led by co-Managing Partners Jacek Korpala and Brian Wardrop. „ARX III represents a continuation of the strategy we have pursued over the past several years with DBG II; and our geographic focus and investment style are well-suited for the current market environment”, said Korpala. Wardrop added, „succession-driven dealflow in the CEE region is increasing for several fundamental reasons, and ARX is ideally positioned to capitalize on these opportunities”.</p>\n<p>ARX III will target equity investments of € 3-15 million per transaction.\nRecent ARX events reinforce the attractiveness of the CEE lower mid-market segment. On September 1, 2008, ARX completed an exit from its investment in Donit Tesnit in Slovenia, realizing a cash-on-cash return of 3 times and an IRR of 58%. Then, on September 26, 2008, ARX completed the concurrent acquisitions of two complementary businesses in the Czech Republic (Lanex a.s. and Singing Rock s.r.o.), in a succession-driven buyout. ARX secured acquisition financing for the transaction from ČSOB and UniCredit banks.</p>\n",
		"updatedAt": "2020-08-30T07:28:47.796Z"
	},
	{
		"perex": "<p>Lanex / Singing Rock Acquisition:</p>",
		"title": "ARX acquires Lanex, Singing Rock and successfully exits Donit Tesnit",
		"date": "2008-10-26T00:00:00.000Z",
		"originalUrl": "https://www.arxequity.com/arx-acquires-lanex-singing-rock-and-successfully-exits-donit-tesnit/",
		"image": null,
		"body": "<p>Lanex / Singing Rock Acquisition:</p>\n<p>On September 26, 2008, Arx completed the acquisition of Lanex a.s. and Singing Rock s.r.o.</p>\n<p>Lanex (<a href=\"http://www.lanex.cz\">www.lanex.cz</a>) is a leading Central European producer of technical textile ropes and flexible packaging. The company’s strategy is increasingly focused on technologically advanced segments of the rope industry.</p>\n<p>Singing Rock (<a href=\"http://www.singingrock.com\">www.singingrock.com</a>) is a world-renowned player in the personal fall protection and climbing equipment market.</p>\n<p>ARX and the Lanex and Singing Rock management teams intend to capitalize on the complementary strengths of each business with the aim of building a leading global player in the rope and climbing equipment market. The combined Lanex / Singing Rock business is on track to generate € 42 M in 2008 sales. Both Lanex and Singing Rock are headquartered in the Czech Republic.</p>\n<p>ČSOB and UniCredit banks provided acquisition financing for the transaction.</p>\n<p>Donit Tesnit Exit:</p>\n<p>ARX is also pleased to announce the successful exit from Donit Tesnit doo, which was completed on September 1, 2008. ARX has exited its investment in Donit Tesnit doo via a sale of 100% of the company to an affiliate of Mohar Satler Investments. ARX generated a return of 3.0 times cash invested and an IRR of 58% on its 2006 investment in the company.</p>\n",
		"updatedAt": "2020-08-30T07:28:47.848Z"
	},
	{
		"perex": "<p>On March 6, 2009, ARX completed the acquisition of controlling stake in Kakadu Sp. z o.o. The investment is shared between the two funds managed by ARX: DBG Eastern Europe II LP and ARX CEE III LP.</p>",
		"title": "ARX acquires controlling stake in Kakadu",
		"date": "2009-03-06T00:00:00.000Z",
		"originalUrl": "https://www.arxequity.com/arx-acquires-controlling-stake-in-kakadu/",
		"image": null,
		"body": "<p>On March 6, 2009, ARX completed the acquisition of controlling stake in Kakadu Sp. z o.o. The investment is shared between the two funds managed by ARX: DBG Eastern Europe II LP and ARX CEE III LP.</p>\n<p>Kakadu (<a href=\"http://www.kakadu.pl\">www.kakadu.pl</a>) is a leading pet products retail chain in Poland. The company operates 25 stores located in large cities.</p>\n<p>ARX and the Kakadu management intend to strengthen the company’s market leadership by implementing operating improvements, the roll out of new stores and add-on acquisitions.</p>\n<p>Kakadu is on track to exceed EUR 20 million in 2009 sales.</p>\n",
		"updatedAt": "2020-08-30T07:28:47.814Z"
	},
	{
		"perex": "<p>On April 23, 2009, Professor Martin Filipec and ARX Equity Partners (“ARX”) completed the leveraged acquisition of 100% of the Lexum Group of companies (“Lexum”). Lexum is the leading network of private ophthalmology clinics in the Czech Republic.</p>",
		"title": "Professor Martin Filipec partners with ARX to acquire 100% of the Lexum Group",
		"date": "2009-04-23T00:00:00.000Z",
		"originalUrl": "https://www.arxequity.com/professor-martin-filipec-partners-with-arx-to-acquire-100-of-the-lexum-group/",
		"image": null,
		"body": "<p>On April 23, 2009, Professor Martin Filipec and ARX Equity Partners (“ARX”) completed the leveraged acquisition of 100% of the Lexum Group of companies (“Lexum”). Lexum is the leading network of private ophthalmology clinics in the Czech Republic.</p>\n<p>Lexum currently operates clinics in Prague, Ostrava and České Budějovice, with a Brno clinic scheduled to open in summer 2009. In 2008, Lexum successfully performed over 11,000 cataract operations and over 5,700 laser refractive corrective procedures. Lexum is the clear Czech private eye surgery market leader, both in terms of medical reputation and size.</p>\n<p>Lexum was founded in 1993 by Professor Filipec, who was Chair of the Department of Ophthalmology at the Teaching Hospital and the 1st Medical Faculty of Charles’ University (Prague), following a fellowship at Harvard Medical School (Boston) and studies at Hôtel Dieu (Paris). Professor Filipec stated, “my partnership with ARX has created a streamlined ownership structure, which will provide a solid foundation for continued client service excellence, while facilitating the next growth phase for Lexum”.</p>\n<p>ARX will work in partnership with Professor Filipec to expand Lexum both within the Czech Republic and potentially in other markets of Central and Eastern Europe. “ARX is privileged to work with the world-class team of medical professionals at Lexum; and we look forward to implementing the company’s growth strategy alongside Professor Filipec”, said ARX Co-Managing Partner Brian Wardrop.</p>\n<p>Senior acquisition debt facilities for the transaction were provided by LBBW Bank (Czech Republic).</p>\n",
		"updatedAt": "2020-08-30T07:28:47.822Z"
	},
	{
		"perex": "<p>Arx Equity Partners (“ARX”), the leading lower mid-market private equity firm focused on Central and Eastern Europe, has completed the € 102 M second close of its third fund, ARX III, on schedule to reach its € 125 M target. ARX III completed its € 83 M first close in October 2008 from a number of blue chip global financial institutions. ARX has been successfully investing in CEE since 1998.</p>",
		"title": "ARX completes € 102 M second close of ARX III",
		"date": "2009-10-08T00:00:00.000Z",
		"originalUrl": "https://www.arxequity.com/arx-completes-e-102-m-second-close-of-arx-iii/",
		"image": null,
		"body": "<p>Arx Equity Partners (“ARX”), the leading lower mid-market private equity firm focused on Central and Eastern Europe, has completed the € 102 M second close of its third fund, ARX III, on schedule to reach its € 125 M target. ARX III completed its € 83 M first close in October 2008 from a number of blue chip global financial institutions. ARX has been successfully investing in CEE since 1998.</p>\n<p>The fund’s core focus continues to be succession-driven buyouts, where ARX has an established track record as a valued investment partner. ARX has a strong locally based team and has completed more buyouts to date than any private equity group in the CEE lower mid-market.</p>\n<p>In recent years, CEE has become an increasingly attractive market for investment and, selectively, continues to offer risk-adjusted value creation opportunities. EU membership has brought financial stability for core CEE countries. The geographic proximity of CEE to the markets of Western Europe, coupled with highly skilled and lower-cost labour markets have contributed to rapid economic growth. In addition, the maturing legal and financial framework has enabled leveraged buyouts to become more established.</p>\n<p>The lower end of the mid market offers a multiplication of investment opportunities compared to the larger end, with significantly less competition. ARX III has already made 2 investments; Kakadu, a leading Polish pet product retailer and Lexum, a healthcare business based in the Czech Republic. The fund will continue the proven investment strategy of previous funds, focusing on stable, cash-generative mid-market businesses across the CEE region. Equity investments in the fund will range between € 3 M – € 15 M, with deal enterprise values ranging between € 10 – € 50 M.</p>\n<p>ARX, formerly known as DBG Eastern Europe, was sponsored by Deutsche Beteiligungs AG from inception through early 2008. ARX is now fully independent. Its first two funds, DBG I and DBG II raised € 46 M and € 67 M in 1997 and 2003 respectively. DBG I returned € 190 M net to investors, and ranks as one of the best performing funds in the CEE region. To date, DBG II’s current portfolio has demonstrated resilience to the current economic downturn, with no write-offs, limited write-downs plus three profitable full or partial exits.</p>\n<p>Jacek Korpala, Co-Managing Partner, ARX commented:</p>\n<p>„We perceive the current investment environment in CEE as particularly attractive for established investors who really understand the local market. Acquisition finance is still available in certain CEE countries, for lower mid-market deals, and while there are few alternative sources of exit liquidity, there are also a large number of business owners who have over-extended into non-core ventures. All of these factors play to our proven strengths.”</p>\n<p>Brian Wardrop, Co-Managing Partner, ARX commented:</p>\n<p>„We are delighted to have achieved the second close of ARX III, on target, and in an extremely difficult fundraising environment. Our ability to attract new investors, while continuing to maintain interest from investors in our earlier funds, shows the strength of our market leading track record, as well as the attractiveness of our investment model in the current environment. Even though ARX III is larger than our previous funds, we remain firmly focused on our target investment size and market, namely established small to mid-sized businesses across CEE.”</p>\n",
		"updatedAt": "2020-08-30T07:28:47.837Z"
	},
	{
		"perex": "<p>On January 21, 2010, the Lexum Group of companies, backed by ARX Equity Partners (“ARX”), completed the add-on acquisition of a 100% ownership interest in Intermedica. Intermedica was sold by Transmedica A/S. ARX has held a controlling stake in the Lexum Group since April 2009, when the company was acquired in partnership with the founder, Professor Martin Filipec.</p>",
		"title": "ARX supports its portfolio company Lexum in the acquisition of Intermedica",
		"date": "2010-01-21T00:00:00.000Z",
		"originalUrl": "https://www.arxequity.com/arx-supports-its-portfolio-company-lexum-in-the-acquisition-of-intermedica/",
		"image": null,
		"body": "<p>On January 21, 2010, the Lexum Group of companies, backed by ARX Equity Partners (“ARX”), completed the add-on acquisition of a 100% ownership interest in Intermedica. Intermedica was sold by Transmedica A/S. ARX has held a controlling stake in the Lexum Group since April 2009, when the company was acquired in partnership with the founder, Professor Martin Filipec.</p>\n<p>Lexum is the leading player in the ophthalmology market in the Czech Republic. Lexum currently operates clinics in Prague, Ostrava, České Budějovice and Brno. In 2009, Lexum successfully performed over 12,000 cataract operations and over 5,000 laser refractive corrective procedures. Lexum is the clear Central European eye surgery market leader, both in terms of medical reputation and size.</p>\n<p>Intermedica is the largest chain of private ophthalmology clinics in Poland. Intermedica operates clinics in Krakow, Poznan and Szczecin. Laser refractive corrections and cataract operations are performed in each of the clinic. Intermedica successfully performed a total of more than 3,700 ophthalmological surgical procedures in 2009.</p>\n<p>Brian Wardrop, Co-Managing Partner, ARX commented:\n„The ARX Warsaw office was a key catalyst for the origination and execution of Lexum’s acquisition of Intermedica. The transaction is representative of the firm’s ability to leverage its local presence throughout CEE.</p>\n<p>ARX is delighted to be supporting Lexum’s strategic objective to grow and consolidate a leading position in the CEE ophthalmology market. The opportunities for knowledge sharing between the medical teams in the Czech Republic and Poland will enhance the group’s ability to provide superior eye care to patients in both countries.”</p>\n<p>Financial details of the transaction were not disclosed.</p>\n",
		"updatedAt": "2020-08-30T07:28:47.894Z"
	},
	{
		"perex": "<p>ARX Equity Partners (“ARX”) has completed a leveraged management buyout of a majority shareholding in Krkonošské vápenky Kunčice a.s. (“KVK”) and its subsidiary, Parabit Technologies s.r.o. (“Parabit”).</p>",
		"title": "ARX acquires Krkonošské vápenky Kunčice a.s.",
		"date": "2010-09-04T00:00:00.000Z",
		"originalUrl": "https://www.arxequity.com/arx-acquires-krkonosske-vapenky-kuncice-a-s/",
		"image": null,
		"body": "<p>ARX Equity Partners (“ARX”) has completed a leveraged management buyout of a majority shareholding in Krkonošské vápenky Kunčice a.s. (“KVK”) and its subsidiary, Parabit Technologies s.r.o. (“Parabit”).</p>\n<p>KVK (<a href=\"http://www.kvk.cz\">www.kvk.cz</a>) is the largest independent Czech producer of mortars used in construction, wall renderings, construction adhesives and fillings for mortar joints. KVK also operates two quarries which produce stone products for various applications.</p>\n<p>Parabit (<a href=\"http://www.parabit.cz\">www.parabit.cz</a>) is a leading Czech producer of oxidized and modified bitumen hydro insulation sheets. Parabit’s oxidized membranes are used for flat roofs, waterproofing of foundations and basements. Modified membranes are typically used in road and bridge construction.</p>\n<p>ARX and the KVK management team will focus on expanding the business and completing complementary add-on acquisitions from the KVK platform. „We are delighted to have the opportunity work with the outstanding KVK management team. As one of the few construction materials groups in the Czech Republic that has remained highly profitable throughout the economic downturn, we believe KVK is well positioned to benefit from attractive medium-term growth prospects in the Czech residential reconstruction and new build markets,” said ARX Co-Managing Partner Brian Wardrop.</p>\n<p>KVK’s annual sales exceed € 30 million. Financial details of the transaction were not disclosed.</p>\n",
		"updatedAt": "2020-08-30T07:28:47.799Z"
	},
	{
		"perex": "<p>Bohumín, 2nd November, 2010 – ARX Equity Partners, the CEE focused private equity investment firm, has joined current owner Benson Oak Capital as investor in the Bochemie Group, one of CEE‘s leading producers of household care products and a manufacturer of high value-added specialty chemicals. ARX will take a minority stake in the Group.</p>",
		"title": "ARX Equity Partners joins Benson Oak Capital as investor in Bochemie",
		"date": "2010-11-02T00:00:00.000Z",
		"originalUrl": "https://www.arxequity.com/arx-equity-partners-joins-benson-oak-capital-as-investor-in-bochemie/",
		"image": null,
		"body": "<p>Bohumín, 2nd November, 2010 – ARX Equity Partners, the CEE focused private equity investment firm, has joined current owner Benson Oak Capital as investor in the Bochemie Group, one of CEE‘s leading producers of household care products and a manufacturer of high value-added specialty chemicals. ARX will take a minority stake in the Group.</p>\n<p>The investment by ARX is intended to support and facilitate Bochemie’s strategy to continue to deepen and widen its business activities via acquisitions, in particular in the Central and Southeastern European household care sector, by bolstering available financial resources.</p>\n<p>„We gladly welcome an investor with a proven track record and intimate knowledge of the geographies where we wish to expand our key businesses“, said Ladislav Kraus, the CEO of Bochemie Group.</p>\n<p>Brian Wardrop, Co-Managing Partner of ARX Equity Partners said: „Bochemie has a tremendous opportunity to grow both organically and via acquisitions in the CEE region, and we are keen to support Benson Oak Capital and Group management in their pursuit of these objectives“.</p>\n<p>Benson Oak Capital’s founder Gabriel Eichler is pleased to see that ARX Equity Partners share BOC’s confidence in the group: “We have made a significant commitment to Bochemie Group both in terms of our capital and resources and are delighted to see that ARX shares our confidence in the Group’s growing business”, he commented.</p>\n<p>Baker &amp; McKenzie and White &amp; Case assisted the parties in the transaction. Transaction details have not been disclosed.</p>\n<p>About Bochemie Group</p>\n<p>Bochemie Group is one of the leading Central European producers of household care products. Its key brands include SAVO, which is particularly strong in the Czech Republic and Slovakia, and ULTRA in Hungary. The Group is also a global supplier of high value added specialty chemicals, including disinfectants, fungicides, metal surface treatment chemicals and accumulator masses. The Group’s 2010 revenues are expected to reach EUR70 mil.</p>\n<p>The Group and Bochemie, its parent company, are headquartered in Bohumín, Czech Republic. The Group further includes EVM, the Hungarian manufacturer of household care products, the Czech engineering company Ekomor, the Polish based pigment manufacturer Permedia and Group’s trading subsidiaries in Slovakia, Poland, Hungary, Bulgaria, Romania and Russia.</p>\n<p>Further information is available at <a href=\"http://www.bochemie.cz\">www.bochemie.cz</a> and <a href=\"http://www.savo.eu\">www.savo.eu</a>.</p>\n",
		"updatedAt": "2020-08-30T07:28:47.926Z"
	},
	{
		"perex": "<p>ARX Equity Partners, through a holding vehicle Finergis Investments Limited, has acquired 51% shareholding in CS Recycling Sp. z o.o.</p>",
		"title": "ARX investment in CS Recycling",
		"date": "2010-12-20T00:00:00.000Z",
		"originalUrl": "https://www.arxequity.com/arx-investment-in-cs-recycling/",
		"image": null,
		"body": "<p>ARX Equity Partners, through a holding vehicle Finergis Investments Limited, has acquired 51% shareholding in CS Recycling Sp. z o.o.</p>\n<p>CS Recycling (<a href=\"http://www.csrecycling.pl\">www.csrecycling.pl</a>) was established in 2004. The main activity of the Company is plastics recycling (mainly PET).</p>\n<p>Financial details of the transaction were not disclosed.</p>\n",
		"updatedAt": "2020-08-30T07:28:47.907Z"
	},
	{
		"perex": "<p>ARX Equity Partners (“ARX”) has completed a management buy-in of a majority shareholdingin Manag a.s. (“Manag”).</p>",
		"title": "ARX Equity Partners acquires Manag",
		"date": "2011-06-28T00:00:00.000Z",
		"originalUrl": "https://www.arxequity.com/arx-equity-partners-acquires-manag/",
		"image": null,
		"body": "<p>ARX Equity Partners (“ARX”) has completed a management buy-in of a majority shareholdingin Manag a.s. (“Manag”).</p>\n<p>Manag (<a href=\"http://www.manag.com\">www.manag.com</a>) is a leading Czech company focused on design, manufacturing and assembly of electrical equipment, and related regulatory and control systems. The company is particularly strong in serving clients from refi nery, chemical and pharmaceutical industries. Manag is also active in Slovakia through its local subsidiary.</p>\n<p>ARX and Manag’s management team aim to expand the business organically as well as through complementary add-on acquisitions. „Manag has repeatedly won confi dence of its customers for whom Manag’s services are critically important from operational and safety perspective. The company is well-positioned to take advantage of its technical know-how to expand the business beyond its current narrow market niche.” says David Marek, ARX’s Partner who led the transaction.</p>\n<p>Manag’s annual sales exceed € 10 million. Financial details of the transaction will not be disclosed.</p>\n",
		"updatedAt": "2020-08-30T07:28:47.781Z"
	},
	{
		"perex": "<p>Moonray Healthcare today announced the acquisition of Lexum – the market leading provider of ophthalmology in Czech Republic and Poland. The deal will see a phased transfer of ownership from current investors ARX Equity Partners and founder Professor Martin Filipec, who will remain with the group. Lexum operates 10 hospitals across Central Europe including the European Eye Centre, a new 2,500m2 flagship eye hospital in Prague. Moonray Healthcare intends to combine the group with Optegra®, it’s UK based eye hospital group which operates 11 specialist hospitals across England and Germany. Together the group will annually perform more than 40,000 surgical procedures and be one of the world’s largest providers of ophthalmology.</p>",
		"title": "Moonray Healthcare acquires Lexum",
		"date": "2012-12-17T00:00:00.000Z",
		"originalUrl": "https://www.arxequity.com/moonray-healthcare-acquires-lexum/",
		"image": null,
		"body": "<p>Moonray Healthcare today announced the acquisition of Lexum – the market leading provider of ophthalmology in Czech Republic and Poland. The deal will see a phased transfer of ownership from current investors ARX Equity Partners and founder Professor Martin Filipec, who will remain with the group. Lexum operates 10 hospitals across Central Europe including the European Eye Centre, a new 2,500m2 flagship eye hospital in Prague. Moonray Healthcare intends to combine the group with Optegra®, it’s UK based eye hospital group which operates 11 specialist hospitals across England and Germany. Together the group will annually perform more than 40,000 surgical procedures and be one of the world’s largest providers of ophthalmology.</p>\n<p>Moonray Healthcare and Optegra CEO, Tim Clover commented that Lexum provided Optegra with a high quality growth platform in an exciting region. “We see lots of similarities between the two groups in terms of quality, innovation and strategy which means that for patients, doctors and employees this marriage makes perfect sense. We hope to exchange the great ideas that we have seen in due diligence between the two companies and further improve patient care and business performance. This investment in Lexum is the latest stage of a significant expansion plan which will continue in further regions.“</p>\n<p>Professor Martin Filipec who founded Lexum and continues as Chief Medical Officer commented “Optegra and Lexum both deliver a broad range of premium care in ophthalmology from CLARIVU™, cataract and vitreoretinal surgery, laser refractive surgery, corneal transplants, strabism and oculoplastics surgery. Both companies are professionally driven with prominent doctor engagement and strong external links to ophthalmic research and development. I believe that the combined company will be able to contribute to real innovation in eye care and also act as a partner to the medical device industry in the further development and adoption of the latest technology, which will bring real benefits to patients.” Professor Filipec went on to thank ARX Equity Partners for its support in building Lexum across both Czech Republic and Poland.</p>\n<p>Financial details of the transaction were not disclosed.</p>\n<p>Moonray Healthcare was advised by KPMG and DLA Piper. ARX Equity Partners and Martin Filipec were advised by White &amp; Case.</p>\n<p>About Optegra</p>\n<p>Optegra is a specialist provider of ophthalmic services in the UK and Germany. Optegra operates six UK eye hospitals in London, Surrey, Birmingham, Solent, Yorkshire and Manchester and five German eye centres in Kreuzberg in Berlin, Prenzlauer Berg in Berlin, Magdeburg, Krefeld and Aachen. The combined group is supported by over 60 consultant level ophthalmic surgeons. Optegra’s areas of expertise are: laser eye surgery, Clarivu™ (Optegra’s refractive Lens Exchange) cataracts, glaucoma, retinal disease, age-related macular degeneration (AMD) and cosmetic eye surgery. A key area of competency for Optegra is Clarivu, for the correction of Presbyopia which is a procedure during which the existing lens – which hardens over time – is replaced with a new lens that is precisely customised to the individual’s requirements. Clarivu can correct both long and short-sightedness and prevents or eliminates cataract in one proven and permanent procedure, even if you’ve got astigmatism. Optegra Eye Sciences is a not-for-profit research division of the organization which is committed to championing innovations in eye care by partnering with surgeons, industry and researchers at leading Universities</p>\n<p>For info: <a href=\"http://www.optegra.com\">www.optegra.com</a> <a href=\"http://www.clarivu.com\">www.clarivu.com</a></p>\n<p>About Lexum</p>\n<p>Lexum is a provider of general ophthalmology and refractive surgery through ten hospitals in the Czech Republic (Prague, Ceske Budejovice, Ostrava, Brno and Tabor) and Poland (Poznan, Krakow, Szczecin, Warsaw and Wroclaw). Working with over 40 surgical ophthalmologists, the business offers a full range of surgical expertise including cataract, glaucoma, retinal, corneal, AMD and cosmetic eye surgery. In 2012, Lexum crossed a historical milestone by performing its 150,000th surgery.</p>\n<p>For info: <a href=\"http://www.lexum.cz\">www.lexum.cz</a>, <a href=\"http://www.lexum.pl\">www.lexum.pl</a></p>\n<p>About ARX Equity Partners</p>\n<p>ARX Equity Partners is a Central and Eastern European focused private equity firm. ARX operates from offices in Bucharest, Budapest, Prague and Warsaw and its investor base is comprised of institutional investors. The ARX family of funds is organized to make equity investments in Central and Eastern European countries, with a focus on later stage investments such as expansion financing, management buy-outs and buy-ins and industry consolidation transactions.</p>\n<p>For info: <a href=\"http://www.www.arxequity.com\">www.www.arxequity.com</a></p>\n<p>About Moonray Healthcare</p>\n<p>Moonray Healthcare is a buy and build investment company specialising in healthcare and medical sciences. Its aim is to focus on identifying organisations with great potential, operating in markets which offer long term growth, to create global businesses with sustainable profits. With a rare combination of debt-free growth capital, management expertise and a global network, Moonray Healthcare’s investment objectives are long term, allowing business planning to incorporate high quality value drivers such as R&amp;D, scientific advancement and building of new market segments or territories.</p>\n<p>For info: <a href=\"http://www.moonrayhealthcare.com\">www.moonrayhealthcare.com</a></p>\n",
		"updatedAt": "2020-08-30T07:28:47.877Z"
	},
	{
		"perex": "<p>ARX Equity Partners (“ARX”) completed the acquisition of a majority stake in Fincentrum a.s. alongside Capital Dynamics (independent global asset manager with USD 17 billion under management) and Lubor Žalman (former CEO of Raiffeisen Czech Republic). Fincentrum is one of the leading independent financial intermediaries (“IFA”) in the Czech Republic and Slovakia.</p>",
		"title": "ARX Equity Partners invests in Fincentrum a.s.",
		"date": "2013-04-05T00:00:00.000Z",
		"originalUrl": "https://www.arxequity.com/arx-equity-partners-invests-in-fincentrum-a-s/",
		"image": null,
		"body": "<p>ARX Equity Partners (“ARX”) completed the acquisition of a majority stake in Fincentrum a.s. alongside Capital Dynamics (independent global asset manager with USD 17 billion under management) and Lubor Žalman (former CEO of Raiffeisen Czech Republic). Fincentrum is one of the leading independent financial intermediaries (“IFA”) in the Czech Republic and Slovakia.</p>\n<p>Fincentrum (<a href=\"http://www.fincentrum.com\">www.fincentrum.com</a>) strives to be the best distribution partner for banks and insurance companies, and operates in a rapidly growing market driven by higher penetration of financial products and the rising importance of the IFA distribution channel. The founders of Fincentrum, Martin Nejedlý and Petr Stuchlík, will remain as significant minority shareholders in the company and will continue to manage the business going forward. Lubor Žalman will become Fincentrum’s Chairman of the Supervisory Board.</p>\n<p>„In my own as well as ARX’ and Capital Dynamics’ opinion, Fincentrum possesses the greatest potential for future growth of all companies operating in the industry in the Czech Republic and Slovakia. Martin and Petr have managed to build truly an excellent company that relies on quality and innovation as the key pillars for future development. The financial investors and I feel honored to have the opportunity to join their efforts.” said Lubor Žalman.</p>\n<p>Fincentrum’s 2012 consolidated sales exceeded CZK 1.2 billion. Financial details of the transaction were not disclosed.</p>\n",
		"updatedAt": "2020-08-30T07:28:47.915Z"
	},
	{
		"perex": "<p>Unilever Czech Republic and the Bochemie company announced today that they have signed an agreement under which Unilever will acquire the SAVO and other consumer brands from Bochemie.</p>",
		"title": "Unilever Czech Republic acquires SAVO brand",
		"date": "2013-04-08T00:00:00.000Z",
		"originalUrl": "https://www.arxequity.com/unilever-czech-republic-acquires-savo-brand/",
		"image": null,
		"body": "<p>Unilever Czech Republic and the Bochemie company announced today that they have signed an agreement under which Unilever will acquire the SAVO and other consumer brands from Bochemie.</p>\n<p>The transaction includes transfer of the related trademarks, other intellectual property and a small number of employees. The acquired brands will continue to be manufactured under contact by Bochemie at their Bohumín facility. The acquisition is subject to regulatory approval by the relevant competition authorities.</p>\n<p>As Unilever aims to double its business whilst reducing environmental impact, it is continuously looking for growth opportunities and to further build its portfolio. Currently the SAVO brand includes a whole range of household cleaning products and disinfectants, so this acquisition will widen Unilever’s product portfolio in order to serve all consumers with their specific needs.</p>\n<p>Unilever will buy SAVO, Biolit, Diffusil and other brands by acquisition of 100% of shares of Bochemie’s subsidiary HomeBrands, a.s. The transaction does not concern Bochemies activities relating to specialty chemicals, which will continue without changes. Bochemie will also continue manufacturing SAVO products in its Bohumín facility based on a contract manufacturing agreement.</p>\n<p>„Unilever is constantly investing in building its brands and looking for new market opportunities. This is a valuable acquisition for us, having well known brands and a well-established position in the market. These brands will benefit from Unilever’s marketing strengths and resources,” said Florin Trandafirescu, General Manager Unilever Czech and Slovak Republic.</p>\n<p>„We view the transaction as recognition of the long term successful work of Bochemie employees in building strong local brands. We are convinced that Unilever will build on those efforts and further expand the brands it is buying from us both locally and internationally,” commented Bochemie CEO Miloslav Vodička. „Bochemie will now focus on further development of its specialty chemical business,” he added.</p>\n<p>All acquired brands will continue to be available on the Czech and Slovak market as well as in Hungary, Romania, and other Central and Eastern European markets.</p>\n<p>About SAVO brand</p>\n<p>SAVO brand was introduced to the market of former Czechoslovakia as early as in 1973. Currently the brand includes a whole range of household cleaning products and disinfectants. It consists of branded products both on the hypochlorite basis being used by households for general disinfection purposes and mildew removal, as well as hypochlorite free specialised cleaning products for kitchen, bathroom and other specific needs.</p>\n<p>About Bochemie Group</p>\n<p>Bochemie Group is one of the leading manufacturers and suppliers of branded household care products in Central Europe. Its key brands include SAVO, Biolit and Diffusil, which all enjoys a strong market position particularly in the Czech Republic and Slovakia.</p>\n<p>The Group is also a global supplier of high value added specialty chemicals, including disinfectants, wood protection fungicides, metal surface treatment chemicals and accumulator masses.</p>\n<p>The Group and its parent company Bochemie, a.s. have been headquartered in Bohumín, Czech Republic, where it employs over 450 people. The Group further includes EVM, the Hungarian manufacturer of branded household care products and subsidiaries in Slovakia, Poland, Romania, Bulgaria and Russia. The Group’s total number of employees is almost 600.</p>\n<p>The Group is owned by the private equity firms Benson Oak Capital and Arx Equity Partners.</p>\n",
		"updatedAt": "2020-08-30T07:28:47.869Z"
	},
	{
		"perex": "<p>ARX Equity Partners (“ARX”) has fully exited its investment in Polish plastics processor, ERGIS-EUROFILMS S.A. (“Ergis”), generating an overall internal rate of return of over 33% and 4.5x cash-on-cash multiple. The ARX exit was executed via a series of block trades to investors on the Warsaw Stock Exchange in December 2013, which followed the partial realization of the Ergis investment in 2006.</p>",
		"title": "ARX Equity Partners Fully Exits Ergis-Eurofilms",
		"date": "2013-12-19T00:00:00.000Z",
		"originalUrl": "https://www.arxequity.com/arx-equity-partners-fully-exits-ergis-eurofilms/",
		"image": null,
		"body": "<p>ARX Equity Partners (“ARX”) has fully exited its investment in Polish plastics processor, ERGIS-EUROFILMS S.A. (“Ergis”), generating an overall internal rate of return of over 33% and 4.5x cash-on-cash multiple. The ARX exit was executed via a series of block trades to investors on the Warsaw Stock Exchange in December 2013, which followed the partial realization of the Ergis investment in 2006.</p>\n<p>ARX originally acquired a majority shareholding in the packaging company in 2003 in a leveraged management buyout transaction in partnership with Ergis Managers Tadeusz Nowicki and Marek Gorski. Several value-creation initiatives have been implemented during the period of ARX ownership, including the relocation and consolidation of production sites, divestments of non-core assets and the completion of three complementary add-on acquisitions. Ergis revenues tripled during the period of ARX ownership, growing to more than € 153 million in 2012, and today the company generates more than half of its revenues outside Poland.</p>\n<p>ARX Co-Managing Partner Jacek Korpala commented, “Our investment in Ergis is an excellent example of the long-term value-creation potential of the CEE lower mid-market. Key pillars of the ARX investment strategy were successfully implemented in Ergis, including the formation of a successful partnership with management and creating value through add-on acquisitions.”</p>\n",
		"updatedAt": "2020-08-30T07:28:47.886Z"
	},
	{
		"perex": "<p>ARX Equity Partners (“ARX”) and Darby Private Equity (“Darby”), the private equity arm of Franklin Templeton Investments, together with experienced food industry executive Gerard Lenihan, have completed the buyout of Gramex 2000 Kft. Financial details of the transaction were not disclosed.</p>",
		"title": "ARX and Darby acquire Gramex Kft.",
		"date": "2014-02-10T00:00:00.000Z",
		"originalUrl": "https://www.arxequity.com/arx-and-darby-acquire-gramex-kft/",
		"image": null,
		"body": "<p>ARX Equity Partners (“ARX”) and Darby Private Equity (“Darby”), the private equity arm of Franklin Templeton Investments, together with experienced food industry executive Gerard Lenihan, have completed the buyout of Gramex 2000 Kft. Financial details of the transaction were not disclosed.</p>\n<p>Gramex (<a href=\"http://www.gramex2000.hu\">www.gramex2000.hu</a>) is a leading Hungarian manufacturer and bottler of nonalcoholic beverages, providing high quality products under its own brands, as well as in partnership with strong local and international retailers and A-brand producers. ARX, Darby and Lenihan intend to grow Gramex in the coming years organically, via regional expansion. Among other previous executive roles, Lenihan was also the CEO in a private equity-backed management buyout in Hungary in 1996. „Gramex has grown sales dynamically over the past three years, exceeding the overall market trend, and we believe that Gramex can further leverage its reputation and service capabilities to grow in Hungary as well as internationally”, said Lenihan.</p>\n",
		"updatedAt": "2020-08-30T07:28:47.784Z"
	},
	{
		"perex": "<p>On June 3, 2014, members of the Polish Private Equity &amp; Venture Capital Association (PPEA) met to celebrate the award of „Private Equity Diamonds” for the year 2013 with a gala evening in Warsaw. We are pleased to announce that on this event Jacek Korpala, Managing Partner of ARX, was named as Private Equity Personality of the year 2013 in Poland. The ceremony was the culmination of the V edition of Private Equity Forum – a conference, which every year brings together the leaders of the sector in Poland. We are especially proud of the fact that Jacek’s contribution to the development of the industry were recognized by the Chapter composed of PE investors and professionals focused on the sector under the leadership of the Director of the Polish Private Equity &amp; Venture Capital Association.</p>",
		"title": "Jacek Korpala named Private Equity Personality of the Year 2013 in Poland",
		"date": "2014-06-04T00:00:00.000Z",
		"originalUrl": "https://www.arxequity.com/jacek-korpala-named-private-equity-personality-of-the-year-2013-in-poland/",
		"image": null,
		"body": "<p>On June 3, 2014, members of the Polish Private Equity &amp; Venture Capital Association (PPEA) met to celebrate the award of „Private Equity Diamonds” for the year 2013 with a gala evening in Warsaw. We are pleased to announce that on this event Jacek Korpala, Managing Partner of ARX, was named as Private Equity Personality of the year 2013 in Poland. The ceremony was the culmination of the V edition of Private Equity Forum – a conference, which every year brings together the leaders of the sector in Poland. We are especially proud of the fact that Jacek’s contribution to the development of the industry were recognized by the Chapter composed of PE investors and professionals focused on the sector under the leadership of the Director of the Polish Private Equity &amp; Venture Capital Association.</p>\n",
		"updatedAt": "2020-08-30T07:22:49.041Z"
	},
	{
		"perex": "<p>ARX Equity Partners (“ARX”), the lower mid-market buyout leader in Central and Eastern Europe, together with experienced executive Jacek Gromniak, have completed the MBI of ANWIS Polska Sp. z o.o. (“Anwis”). Financial details of the transaction, made by ARX CEE III LP, were not disclosed.</p>",
		"title": "ARX acquires ANWIS Polska",
		"date": "2014-08-21T00:00:00.000Z",
		"originalUrl": "https://www.arxequity.com/arx-acquires-anwis-polska/",
		"image": null,
		"body": "<p>ARX Equity Partners (“ARX”), the lower mid-market buyout leader in Central and Eastern Europe, together with experienced executive Jacek Gromniak, have completed the MBI of ANWIS Polska Sp. z o.o. (“Anwis”). Financial details of the transaction, made by ARX CEE III LP, were not disclosed.</p>\n<p>Anwis (<a href=\"http://www.anwis.pl\">www.anwis.pl</a>) is a Polish producer of custom-made window coverings and one of the leading manufacturers of window coverings and related components in Europe. The company has been operating in the region for 35 years and has recently seen rapid growth, with sales reaching € 22.6 million in 2013.</p>\n<p>ARX and Gromniak plan to grow Anwis through organic expansion in existing and new geographies, with selective add-on acquisitions possible in the medium term. At present Anwis operates in Poland, where it has a market leading position, and Germany. The company will seek to further strengthen its position in these markets, as well as looking towards international expansion in the Benelux countries and France.</p>\n<p>The market for tailor-made interior window coverings is forecast to grow steadily in the coming years, with areas addressed by Anwis forecast to grow faster than the overall market at in excess of 5% per annum over the medium-term. The German market for tailor-made interior window coverings is currently worth around € 400 million, while the Polish market for interior and exterior window coverings is approximately half of this size.</p>\n<p>Gromniak, who was previously CEO of Somfy Poland, a major multinational manufacturer of motors and controls for window covering systems, will become CEO of the business. He commented: “Anwis is a clear market leader in Poland in custom-made interior windows coverings. It has grown sales dynamically over the past few years, exceeding the overall market trend, and we believe that it can further leverage its strong reputation for product quality and service capabilities to grow in Poland as well as internationally.”</p>\n<p>ARX Co-Managing Partner Jacek Korpala added: “Anwis is great illustration of the succession-driven dealflow opportunity in CEE, and another example of ARX providing a tailored transaction solution to a retiring founder while partnering with a seasoned and entrepreneurial buy-in manager. We look forward to supporting the company in the next phase of its growth.”</p>\n<p>Anwis founder Antoni Wiśniewski, who had led the company for 35 years, will continue supporting the company as supervisory board member.</p>\n<p>The transaction follows ARX’s acquisition of Gramex, a Hungarian manufacturer and bottler of non-alcoholic beverages, earlier this year, and the full exit of its investment in Polish plastics processor, Ergis Eurofilms in December 2013, which generated an overall internal rate of return of over 33% and 4.5x cash-on-cash multiple.</p>\n",
		"updatedAt": "2020-08-30T07:28:47.830Z"
	},
	{
		"perex": "<p>Placek Holding and Stephon Holdings Limited announced today the signing of an agreement according to which Super Zoo has acquired Kakadu. The transaction includes transfer of 100% of shares.</p>",
		"title": "ARX has completed the exit of its Kakadu investment",
		"date": "2015-01-15T00:00:00.000Z",
		"originalUrl": "https://www.arxequity.com/arx-has-completed-the-exit-kakadu-investment/",
		"image": null,
		"body": "<p>Placek Holding and Stephon Holdings Limited announced today the signing of an agreement according to which Super Zoo has acquired Kakadu. The transaction includes transfer of 100% of shares.</p>\n<p>Stephon Holdings is controlled by private equity funds managed by ARX Equity Partners. Stephon Holdings invested in Kakadu in March 2009, supporting its organic expansion in the following years. Today the company operates 41 specialized pet product stores in Poland and is leading this market segment. Kakadu took over Telekarma in 2011, obtaining a strong position on the Polish pet products internet sales market.</p>\n<p>“Placek Holding is constantly investing in building its retail business in Central and Eastern Europe and is looking for new market opportunities. This is a valuable acquisition for us, having a well-established position in the Czech Republic, Slovakia and Latvia, Kakadu and Telekarma will benefit from Placek Holding’s marketing strengths and resources,” said Dusan Placek, the sole owner of Placek Holding.</p>\n<p>“I view the transaction as recognition of the long term successful work of Kakadu employees in building strong position on the Polish market. I am convinced that Super Zoo will benefit from those efforts and further expand Kakadu and Telekarma. Becoming part of Placek Holding will strengthen leading position of Kakadu on the Polish market and will allow for its further, stable development,” commented Wojciech Filipczyk, ex CEO of Kakadu.</p>\n<p>TPA Horwath Corporate Finances.r.o.(Czech Republic) was the leading buy-side advisory to Placek Holding.</p>\n",
		"updatedAt": "2020-08-30T07:28:47.842Z"
	},
	{
		"perex": "<p>ARX Equity Partners (“ARX”) has completed the exit of its investment in Lanex a.s. (“Lanex”). Czech entrepreneur and industrialist, Rudolf Bochenek, acquired Lanex on November 18, 2014.</p>",
		"title": "ARX exits Lanex a.s.",
		"date": "2015-01-16T00:00:00.000Z",
		"originalUrl": "https://www.arxequity.com/arx-exits-lanex-a-s/",
		"image": null,
		"body": "<p>ARX Equity Partners (“ARX”) has completed the exit of its investment in Lanex a.s. (“Lanex”). Czech entrepreneur and industrialist, Rudolf Bochenek, acquired Lanex on November 18, 2014.</p>\n<p>Lanex is a specialized producer of ropes and fibers with wide assortment range covering climbing, marine, paper and hobby applications, as well as production of fibers for further processing. The company holds the market leadership position in the Czech Republic and is the third largest producer of paper carrier ropes in the world. Lanex is also among the top 5 producers of climbing and safety ropes globally.</p>\n<p>ARX partnered with Lanex’s CEO Rudolf Gregorica and acquired a majority stake in Lanex in October 2008 in a management buyout transaction. During its investment period, ARX supported investment into new production technologies and entering into new markets, including the establishment of a production subsidiary in Russia. As a result of strengthened product development and increased sales activities, Lanex has consistently grown sales and profitability and will achieve € 31 million in sales and € 3 million in EBITDA in 2014.</p>\n<p>ARX Partner Tomas Lansky commented, ”Lanex is an example of a niche Central European manufacturer with solid know-how and competitive advantage, which is able to compete and successfully expand globally. Lanex has doubled its profit margin compared to 2008 when ARX initially invested, which was a result of a solidified position on the Czech market and a successful international expansion“.</p>\n",
		"updatedAt": "2020-08-30T07:28:47.840Z"
	},
	{
		"perex": "<p>ARX Equity Partners (“ARX”) together with experienced healthcare investor Joseph Priel, completed the 100% buy-out of Slovenian healthcare services provider, Diagnosticni Center Bled doo (“DCB”; <a href=\"http://www.dc-bled.si\">www.dc-bled.si</a>). Details of the transaction were not disclosed.</p>",
		"title": "ARX Equity Partners acquires Slovenian healthcare provider",
		"date": "2015-03-16T00:00:00.000Z",
		"originalUrl": "https://www.arxequity.com/arx-equity-partners-acquires-slovenian-healthcare-provider-3/",
		"image": null,
		"body": "<p>ARX Equity Partners (“ARX”) together with experienced healthcare investor Joseph Priel, completed the 100% buy-out of Slovenian healthcare services provider, Diagnosticni Center Bled doo (“DCB”; <a href=\"http://www.dc-bled.si\">www.dc-bled.si</a>). Details of the transaction were not disclosed.</p>\n<p>DCB is the largest private healthcare service provider in Slovenia. The Company provides comprehensive outpatient and inpatient medical services in four locations. DCB performs more than 20,000 specialist examinations each year, primarily in the areas of gastroenterology and urology. ARX acquired DCB in order to utilize its robust existing business as a platform to further consolidate and grow its leading position in the Slovenian diagnostics sector.</p>\n<p>Priel and his operating team will take an active, hands-on role in monitoring DCB and contributing to the value creation process. Priel founded Euromedic International in the early 1990s, which completed more than 100 acquisitions while working with multiple international private equity firms including GE Equity, Warburg Pincus and Montagu. Priel commented on the DCB opportunity, „We believe that DCB is ideally positioned to leverage its strong brand and market leadership to achieve growth through operating initiatives, new service offerings and add-on acquisitions.”</p>\n<p>ARX Partner Bela Lendvai-Lintner added, „We are pleased to acquire DCB, which has an excellent reputation for quality patient care and a superb medical team.” Lendvai-Lintner went on to state that DCB is the fourth ARX acquisition in Slovenia, as the firm has previously acquired Donit Tesnit in 2006, Tomplast in 2007 and its add-on Unitplast in 2008.</p>\n<p>DCB is the second ARX healthcare services buy-and-build transaction. ARX previously acquired Lexum – a Czech operator of ophthalmology clinics – which later completed a complementary add-on in Poland. Lexum was ultimately exited to strategic investor, Optegra.</p>\n",
		"updatedAt": "2020-08-30T07:28:47.896Z"
	},
	{
		"perex": "<p>We are pleased to announce that Jaroslav Horak, Chairman of the ARX Investment Committee, has been named as a finalist for the prestigious 2014 EY Entrepreneur of the Year award for the Czech Republic. The evaluation criteria for the EY Entrepreneur of the Year includes strategic orientation, global reach and financial results – combined with a evaluation of the nominee’s business spirit, their honesty and fairness, plus their activities outside the company in society at large. These evaluation criteria are clearly exemplified by Jaroslav’s contributions to the success of ARX, his achievements in the development of Albatros Media, in addition to his philanthropic work in the Czech Republic.</p>",
		"title": "Jaroslav Horak named EY Entrepreneur Of The Year Nominee in Czech Republic",
		"date": "2015-04-03T00:00:00.000Z",
		"originalUrl": "https://www.arxequity.com/jaroslav-horak-named-ey-entrepreneur-of-the-year-nominee-in-czech-republic/",
		"image": null,
		"body": "<p>We are pleased to announce that Jaroslav Horak, Chairman of the ARX Investment Committee, has been named as a finalist for the prestigious 2014 EY Entrepreneur of the Year award for the Czech Republic. The evaluation criteria for the EY Entrepreneur of the Year includes strategic orientation, global reach and financial results – combined with a evaluation of the nominee’s business spirit, their honesty and fairness, plus their activities outside the company in society at large. These evaluation criteria are clearly exemplified by Jaroslav’s contributions to the success of ARX, his achievements in the development of Albatros Media, in addition to his philanthropic work in the Czech Republic.</p>\n",
		"updatedAt": "2020-08-30T07:22:41.499Z"
	},
	{
		"perex": "<p>On November 5, 2015, the Czech Private Equity and Venture Capital Association (CVCA) celebrated the 20th Anniversary of its foundation with a gala evening in Prague. We are pleased to announce that on this event Brian Wardrop, Managing Partner of ARX, was named as Private Equity Professional of the Last 20 years in the Czech Republic. This award resulted from a poll conducted by the CVCA where all members of the association participated. We are especially proud of the fact that our peers in the Czech private equity community have chosen to recognize the contributions of Brian, which we view as a positive reflection of the ARX market position and the firm’s dedication to Czech private equity.</p>",
		"title": "Brian Wardrop named Private Equity Professional of the last 20 years in Czech Republic",
		"date": "2015-11-09T00:00:00.000Z",
		"originalUrl": "https://www.arxequity.com/brian-wardrop-named-private-equity-professional-of-the-last-20-years-in-czech-republic/",
		"image": null,
		"body": "<p>On November 5, 2015, the Czech Private Equity and Venture Capital Association (CVCA) celebrated the 20th Anniversary of its foundation with a gala evening in Prague. We are pleased to announce that on this event Brian Wardrop, Managing Partner of ARX, was named as Private Equity Professional of the Last 20 years in the Czech Republic. This award resulted from a poll conducted by the CVCA where all members of the association participated. We are especially proud of the fact that our peers in the Czech private equity community have chosen to recognize the contributions of Brian, which we view as a positive reflection of the ARX market position and the firm’s dedication to Czech private equity.</p>\n",
		"updatedAt": "2020-08-30T07:22:40.050Z"
	},
	{
		"perex": "<p>ARX Equity Partners (“ARX”) has exited its 2007 investment in Slovenian producer of plastic components, Tomplast d.o.o. (“Tomplast”), and will generate an overall 4.1x cash-on-cash return multiple and an IRR exceeding 20%. The ARX exit was executed via a sale to funds managed by financial investor KJK Capital.</p>",
		"title": "ARX exits Tomplast d.o.o.",
		"date": "2016-04-18T00:00:00.000Z",
		"originalUrl": "https://www.arxequity.com/arx-exits-tomplast-d-o-o/",
		"image": null,
		"body": "<p>ARX Equity Partners (“ARX”) has exited its 2007 investment in Slovenian producer of plastic components, Tomplast d.o.o. (“Tomplast”), and will generate an overall 4.1x cash-on-cash return multiple and an IRR exceeding 20%. The ARX exit was executed via a sale to funds managed by financial investor KJK Capital.</p>\n<p>The Tomplast investment is consistent with the ARX focus on Central European succession-driven majority buy-outs, with a bias toward export-oriented precision manufacturing companies. ARX acquired a majority shareholding in Tomplast from its retiring founders in 2007. In 2008 Tomplast executed the add-on acquisition of Unitplast d.o.o. (“Unitplast”), which was also a succession-driven situation. Under ARX’s ownership both companies were fully integrated, while the enlarged business was repositioned to focus increasingly on automotive components. The company currently supplies larger and increasingly complex products from its modern Slovenian production facilities, utilizing technologies such as 2K and gas injection. Tomplast revenues grew from € 13 million in 2007 to over € 40 million in 2015, while employee headcount expanded from 77 to 300 during the ARX holding period.</p>\n<p>ARX Managing Partner Brian Wardrop commented: „Our investment in Tomplast is a representative example of the types of opportunities available in the Central European lower mid-market. We succeeded in acquiring two smaller companies, which were both facing acute shareholder and managerial succession issues, in order to create an internationally competitive niche plastic components supplier.”</p>\n<p>Advising on the sale were Arkas Corporate Finance (M&amp;A), Ulcar &amp; Partners (legal) and White &amp; Case (legal).</p>\n",
		"updatedAt": "2020-08-30T07:28:47.808Z"
	},
	{
		"perex": "<p>ARX Equity Partners (“ARX”), a leading lower mid-cap focused private equity firm operating in Central Europe, is pleased to announce the first closing of its fourth fund, ARX CEE IV (the “Fund”), at € 54 million, with total subscribed commitments of € 66 million.</p>",
		"title": "ARX CEE IV holds first close towards € 100 million target, supported by the EU COSME programme",
		"date": "2016-07-11T00:00:00.000Z",
		"originalUrl": "https://www.arxequity.com/arx-cee-iv-holds-first-close-towards-e-100-million-target-supported-by-the-eu-cosme-programme/",
		"image": null,
		"body": "<p>ARX Equity Partners (“ARX”), a leading lower mid-cap focused private equity firm operating in Central Europe, is pleased to announce the first closing of its fourth fund, ARX CEE IV (the “Fund”), at € 54 million, with total subscribed commitments of € 66 million.</p>\n<p>The Fund, which has a target of € 100 million including commitments from the European Investment Fund (EIF), will continue to execute the ARX value-creation strategy of investing in lower mid-cap businesses and SMEs in select Central European countries. ARX has completed 22 platform investments and numerous add-on acquisitions over its two-decade operating history in the region. The EIF investment benefits from EU support under the COSME programme funded by the European Commission.</p>\n<p>ARX anticipates that the majority of the Fund will be invested in the Czech Republic, where the firm has established itself as a market leader in succession-driven transactions. The Czech economy expanded by an impressive 4.3% in 2015, propelled by strong exports, which grew by 7.2% over 2014. Czech GDP growth levels are expected to remain strong in 2016 and 2017, primarily driven by the country’s highly competitive export-oriented precision manufacturing industry.</p>\n<p>The Fund will complement its strong Czech presence with investments in certain additional Central European countries with attractive investment environments, such as Slovenia, where ARX recently generated a 4.1x cash-on-cash return from its Tomplast investment.</p>\n<p>Brian Wardrop, ARX Managing Partner, commented: “We look forward to capitalising on several uniquely distinctive features that are generating succession-driven deal flow momentum in our target market. We are also especially pleased that several well-respected local investors have chosen to endorse the ARX strategy and its differentiated geographic positioning and would like to thank all our investors for their support.”</p>\n<p>First close investors in the Fund include institutions such as the European Investment Fund, leading Czech retail bank Ceska Sporitelna and RSJ Private Equity, in addition to several family offices.</p>\n<p>The ARX IV Fund benefits from the support of the European Union under the Equity Facility for Growth (EFG) established under Regulation (EU) No. 1287/2013 of the European Parliament and the Council establishing a Programme for the Competitiveness of Enterprises and Small and Medium-sized Enterprises (COSME) (2014-2020).</p>\n",
		"updatedAt": "2020-08-30T07:28:47.866Z"
	},
	{
		"perex": "<p>ARX Equity Partners controlled diagnostic healthcare operator DC Bled has completed its first acquisition of the diagnostics center Medi Cons in July 2016. Medi Cons is based in Novo Mesto, Slovenia. The acquisition will allow DC Bled to strengthen its presence in the South East part of the country and to expand its diagnostic capabilities into the field of cardiology. Medi Cons performs more than 3,000 procedures a year. The acquisition of Medi Cons marks an important milestone for DC Bled, as it is the first step in the execution of a broader market consolidation buy-and-build strategy. Further acquisitions and organic expansion of cardiology services is expected in the near future. DC Bled is on-track to organically grow by 10% in 2016. ARX Equity Partners acquired DC Bled in 2015 together with the experienced healthcare investor and founder of Euromedic Joseph Priel.</p>",
		"title": "DC Bled makes first add-on in Slovenia",
		"date": "2016-09-01T00:00:00.000Z",
		"originalUrl": "https://www.arxequity.com/dc-bled-makes-first-add-slovenia/",
		"image": null,
		"body": "<p>ARX Equity Partners controlled diagnostic healthcare operator DC Bled has completed its first acquisition of the diagnostics center Medi Cons in July 2016. Medi Cons is based in Novo Mesto, Slovenia. The acquisition will allow DC Bled to strengthen its presence in the South East part of the country and to expand its diagnostic capabilities into the field of cardiology. Medi Cons performs more than 3,000 procedures a year. The acquisition of Medi Cons marks an important milestone for DC Bled, as it is the first step in the execution of a broader market consolidation buy-and-build strategy. Further acquisitions and organic expansion of cardiology services is expected in the near future. DC Bled is on-track to organically grow by 10% in 2016. ARX Equity Partners acquired DC Bled in 2015 together with the experienced healthcare investor and founder of Euromedic Joseph Priel.</p>\n",
		"updatedAt": "2020-08-30T07:22:35.751Z"
	},
	{
		"perex": "<p>ARX Equity Partners (“ARX”) together with experienced food industry entrepreneur Keith Dilworth entered into a binding agreement relating to the acquisition of Nutricia Deva a.s. (“Deva”) from Danone Group.</p>",
		"title": "ARX Equity Partners acquires Czech baby food producer",
		"date": "2017-01-31T00:00:00.000Z",
		"originalUrl": "https://www.arxequity.com/arx-equity-partners-acquires-czech-baby-food-producer/",
		"image": null,
		"body": "<p>ARX Equity Partners (“ARX”) together with experienced food industry entrepreneur Keith Dilworth entered into a binding agreement relating to the acquisition of Nutricia Deva a.s. (“Deva”) from Danone Group.</p>\n<p>Deva is a Czech Republic based producer of baby fruit desserts and fruit drinks, with total annual capacity of 24,000 tons, and also holds bio and organic certifications.</p>\n<p>ARX together with Keith Dilworth committed to acquire Deva with the aim to expand the existing business via further organic growth and to use the company as a platform to acquire complementary add-on acquisitions. As part of the transaction, Deva will enter into a manufacturing contract and will continue to manufacture baby food desserts under the Danone brands.</p>\n<p>“I am excited to team up with ARX and acquire such a high-quality company and we look forward to continuing a production partnership with the Danone Group.  We are convinced that Deva is well-positioned to leverage its strong asset base, technical know-how and skilled employees, in order to acquire new customers in the future.” says Keith Dilworth, who has been named CEO of Deva.</p>\n<p>The acquisition of Deva will be the first investment made from the fourth ARX Equity Partners managed private equity fund.</p>\n",
		"updatedAt": "2020-08-30T07:28:47.820Z"
	},
	{
		"perex": "<p>On 21 August 2017, ARX Equity Partners exits its investment in the Czech based electrical engineering services company, Manag a.s. (“Manag”) via a sale to a Czech industrial holding Multicraft Group.</p>",
		"title": "ARX exits Manag a.s.",
		"date": "2017-08-22T00:00:00.000Z",
		"originalUrl": "https://www.arxequity.com/arx-exits-manag-s/",
		"image": null,
		"body": "<p>On 21 August 2017, ARX Equity Partners exits its investment in the Czech based electrical engineering services company, Manag a.s. (“Manag”) via a sale to a Czech industrial holding Multicraft Group.</p>\n",
		"updatedAt": "2020-08-30T07:22:32.748Z"
	},
	{
		"perex": "<p>ARX Equity Partners has entered into an agreement to exit portfolio company KVK via a sale to Sika AG. KVK operates six production sites in the Czech Republic – three for the manufacture of mortar products, two for bituminous membranes and one for expanded polystyrene insulation.</p>",
		"title": "ARX portfolio company KVK Holding acquired by Sika",
		"date": "2017-09-05T00:00:00.000Z",
		"originalUrl": "https://www.arxequity.com/arx-portfolio-company-kvk-holding-acquired-sika/",
		"image": null,
		"body": "<p>ARX Equity Partners has entered into an agreement to exit portfolio company KVK via a sale to Sika AG. KVK operates six production sites in the Czech Republic – three for the manufacture of mortar products, two for bituminous membranes and one for expanded polystyrene insulation.</p>\n<p> </p>\n<p>Sika is a specialty chemicals company with a leading position in the development and production of systems and products for bonding, sealing, damping, reinforcing and protecting in the building sector and automotive industry. Sika has subsidiaries in 98 countries and manufactures in over 190 factories.</p>\n<p> </p>\n<p>No financial details have been disclosed and completion of the transaction is subject to clearance by anti-trust authorities.</p>\n",
		"updatedAt": "2020-08-30T07:28:47.860Z"
	},
	{
		"perex": "<p>ARX Equity Partners (“ARX”) has exited its 2010 investment in Czech construction materials manufacturer, KVK Holding a.s. (“KVK”), while generating an overall 3.7x cash-on-cash return multiple and an IRR exceeding 20%. KVK operates six production sites in the Czech Republic – three for the manufacture of mortar products, two for bituminous membranes and one for expanded polystyrene insulation. KVK generated revenues of € 40 million in 2016.</p>",
		"title": "ARX Equity Partners Exits KVK Holding",
		"date": "2017-10-05T00:00:00.000Z",
		"originalUrl": "https://www.arxequity.com/arx-equity-partners-exits-kvk-holding/",
		"image": null,
		"body": "<p>ARX Equity Partners (“ARX”) has exited its 2010 investment in Czech construction materials manufacturer, KVK Holding a.s. (“KVK”), while generating an overall 3.7x cash-on-cash return multiple and an IRR exceeding 20%. KVK operates six production sites in the Czech Republic – three for the manufacture of mortar products, two for bituminous membranes and one for expanded polystyrene insulation. KVK generated revenues of € 40 million in 2016.</p>\n<p> </p>\n<p>The ARX exit was executed via a sale to Sika CZ, s.r.o., a subsidiary of Sika AG (“Sika”). Sika is a Swiss-headquartered specialty chemicals company with a leading position in the development and production of systems and products for bonding, sealing, damping, reinforcing and protecting in the building sector and automotive industry. Sika has subsidiaries in 99 countries and manufactures in over 190 factories.</p>\n<p> </p>\n<p>The KVK investment is consistent with the ARX focus on Central European growth buy-outs. ARX acquired a majority shareholding in KVK from retiring owners in 2010, in a proprietary succession-driven deal, with the intention of completing complementary add-on acquisitions from the strong KVK platform. In 2011 KVK executed its first add-on – the acquisition of KRPA Dehtochema, which augmented the company’s leading position in the Czech and Slovak bituminous membranes market. An additional Czech add-on (the acquisition of Penopol later in 2011) facilitated KVK’s entry into the adjacent expanded polystyrene market segment. Under ARX ownership both companies were fully integrated and significant synergies were realized. Additional value creation initiatives included enhancing the KVK management team and institutionalizing internal processes.</p>\n",
		"updatedAt": "2020-08-30T07:28:47.851Z"
	},
	{
		"perex": "<p>ARX Equity Partners and Moog Inc. (NYSE:MOG.A) (NYSE:MOG.B) have entered into a binding agreement for the sale of VUES Brno s.r.o. (“VUES”) to Moog. The transaction is subject to approval by competition protection authorities and its finalization is expected in approximately two months.</p>",
		"title": "Moog Announces Agreement to Acquire VUES",
		"date": "2018-02-19T00:00:00.000Z",
		"originalUrl": "https://www.arxequity.com/moog-announces-agreement-acquire-vues/",
		"image": null,
		"body": "<p>ARX Equity Partners and Moog Inc. (NYSE:MOG.A) (NYSE:MOG.B) have entered into a binding agreement for the sale of VUES Brno s.r.o. (“VUES”) to Moog. The transaction is subject to approval by competition protection authorities and its finalization is expected in approximately two months.</p>\n<p>VUES is a producer of custom designed specialized electrical motors.</p>\n",
		"updatedAt": "2020-08-30T07:28:47.917Z"
	},
	{
		"perex": "<p>Following an approval by regulatory authorities, ARX Equity Partners (ARX) has completed the exit of its investment in Czech producer of specialized electrical motors VUES Brno s.r.o. (VUES) via a sale to Moog Inc. (NYSE:MOG.A) (NYSE:MOG.B) for a purchase price of € 53 million. The ARX investment into VUES generated an overall 11.8x cash-on-cash return multiple and an IRR of over 30%.</p>",
		"title": "ARX Equity Partners Exits VUES",
		"date": "2018-04-03T00:00:00.000Z",
		"originalUrl": "https://www.arxequity.com/arx-equity-partners-exits-vues/",
		"image": null,
		"body": "<p>Following an approval by regulatory authorities, ARX Equity Partners (ARX) has completed the exit of its investment in Czech producer of specialized electrical motors VUES Brno s.r.o. (VUES) via a sale to Moog Inc. (NYSE:MOG.A) (NYSE:MOG.B) for a purchase price of € 53 million. The ARX investment into VUES generated an overall 11.8x cash-on-cash return multiple and an IRR of over 30%.</p>\n<p>ARX acquired a majority shareholding in VUES from retiring managers in 2006, with the intention to leverage the company’s inherent technical strengths and capabilities in order to grow and further internationalize the business. Over the past eight years VUES expanded its profit margins considerably, while simultaneously doubling sales and increasing headcount by over 30%.</p>\n",
		"updatedAt": "2020-08-30T07:28:47.872Z"
	},
	{
		"perex": "<p>ARX Equity Partners (“ARX”) is delighted to announce the majority acquisition of TMX Mobile Solutions (“TMX“). Going forward, ARX will partner with the company’s senior management, who retain a significant minority stake as part of the deal.</p>",
		"title": "ARX Equity Partners completes buyout of Hungarian mobile device repair business",
		"date": "2018-07-02T00:00:00.000Z",
		"originalUrl": "https://www.arxequity.com/arx-equity-partners-completes-buyout-of-hungarian-mobile-device-repair-business/",
		"image": null,
		"body": "<p>ARX Equity Partners (“ARX”) is delighted to announce the majority acquisition of TMX Mobile Solutions (“TMX“). Going forward, ARX will partner with the company’s senior management, who retain a significant minority stake as part of the deal.</p>\n<p>TMX is a market leader in the Hungarian mobile device repair space and a significant European player more generally. The company is on-track to generate a revenue stream of over €40 million in 2018. TMX employs over 400 skilled staff, who deliver a service-offering comprised of physical repair, logistics and refurbishment of mobile phones. They repair approximately 500,000 mobile devices annually for B2B customers that consist of major mobile device OEMs, smartphone insurance providers and mobile operators respectively.</p>\n<p>The ARX strategy with TMX is to perfect the company’s leading position in what is a growing domestic Hungarian market, while also maximizing the upward trend for mobile device repairs in Central and Eastern Europe. TMX is ideally positioned in terms of scale, logistical capabilities, proximity and cost competitiveness to capture a meaningful share of the European insured device repair market.</p>\n<p>“TMX is a quality business that possesses robust systems, significant geographic coverage capabilities and a blue-chip client base. We are impressed with the company’s ability to efficiently handle complex repairs and the related logistical demands, which combine to deliver a seamless and satisfying customer experience,” explained Bela Lendvai-Lintner, a Partner with ARX.</p>\n<p>“We are excited to welcome ARX as an experienced partner that has a track-record in supporting domestic Central European leaders on their journey toward regional expansion and internationalisation.” said Balazs Kotányi, majority owner of TMX.</p>\n<p>TMX represents the second investment from the fourth ARX managed private equity fund, following the successful exit of VUES in April of this year.</p>\n",
		"updatedAt": "2020-08-30T07:28:47.909Z"
	},
	{
		"perex": "<p>DC Bled has completed the acquisition of diagnostics center Gastromedica in May 2018, located in Murska Sobota. This comes two years after the acquisition of Medi Cons based in Novo Mesto, Slovenia. Later this year DC Bled will consolidate its Kostanevica location with Medi Cons in a modern health center in downtown Novo Mesto. Gastromedica specializes in endoscopy procedures for chronical diseases and performs more than 2,000 procedures a year. Its medical team, including the founder Dr. Puc remain. Despite the slow execution of a broader market consolidation buy-and-build strategy, DC Bled hopes to acquire 2-3 additional clinics by the end of 2018.</p>",
		"title": "DC Bled completes second diagnostic clinic acquisition",
		"date": "2018-08-01T00:00:00.000Z",
		"originalUrl": "https://www.arxequity.com/dc-bled-completes-second-diagnostic-clinic-acquisition/",
		"image": null,
		"body": "<p>DC Bled has completed the acquisition of diagnostics center Gastromedica in May 2018, located in Murska Sobota. This comes two years after the acquisition of Medi Cons based in Novo Mesto, Slovenia. Later this year DC Bled will consolidate its Kostanevica location with Medi Cons in a modern health center in downtown Novo Mesto. Gastromedica specializes in endoscopy procedures for chronical diseases and performs more than 2,000 procedures a year. Its medical team, including the founder Dr. Puc remain. Despite the slow execution of a broader market consolidation buy-and-build strategy, DC Bled hopes to acquire 2-3 additional clinics by the end of 2018.</p>\n",
		"updatedAt": "2020-08-30T07:22:23.798Z"
	},
	{
		"perex": "<p>The transaction strengthens Swiss Life’s presence in this region and Swiss Life together with Fincentrum as a leading financial adviser in the Czech Republic and Slovakia.</p>",
		"title": "ARX portfolio company Fincentrum acquired by the Swiss Life Group",
		"date": "2018-09-04T00:00:00.000Z",
		"originalUrl": "https://www.arxequity.com/arx-portfolio-company-fincentrum-acquired-by-the-swiss-life-group/",
		"image": null,
		"body": "<p>The transaction strengthens Swiss Life’s presence in this region and Swiss Life together with Fincentrum as a leading financial adviser in the Czech Republic and Slovakia.</p>\n<p>Swiss Life acquires Fincentrum, an independent financial advisor founded in 2000 with more than 2,500 financial advisors and a turnover exceeding CZK 1.6 bn that is located in the Czech Republic and Slovakia.</p>\n<p>Swiss Life Group is a leading comprehensive life and pensions and financial solutions provider across Europe. The offering of high-quality financial services for over 160 years has built an excellent reputation and a continuously strong financial standing. </p>\n<p>This acquisition strengthens Swiss Life’s presence in the region and positions the company as a market leader for independent financial advice in Czech Republic and Slovakia.</p>\n<p>To ensure stability and sustainable continuation of both service offerings, Swiss Life Select and Fincentrum will retain their independent brand and sales leadership structure.</p>\n<p>The acquisition is subject to regulatory approval and is expected to be completed in the fourth quarter of 2018. Both parties have agreed not to disclose the purchase price.</p>\n",
		"updatedAt": "2020-08-30T07:28:47.891Z"
	},
	{
		"perex": "<p>Further to regulatory approval, ARX Equity Partners / <a href=\"https://www.arxequity.com\">https://www.arxequity.com</a> (“ARX”) has successfully completed the exit of its investment in Fincentrum / <a href=\"https://www.fincentrum.com,a\">https://www.fincentrum.com,a</a> leading, independent financial advisory business operating in the Czech Republic and Slovakia respectively.</p>",
		"title": "ARX Equity Partners completes sale of Fincentrum to Swiss Life",
		"date": "2018-10-22T00:00:00.000Z",
		"originalUrl": "https://www.arxequity.com/arx-equity-partners-completes-sale-of-fincentrum-to-swiss-life/",
		"image": null,
		"body": "<p>Further to regulatory approval, ARX Equity Partners / <a href=\"https://www.arxequity.com\">https://www.arxequity.com</a> (“ARX”) has successfully completed the exit of its investment in Fincentrum / <a href=\"https://www.fincentrum.com,a\">https://www.fincentrum.com,a</a> leading, independent financial advisory business operating in the Czech Republic and Slovakia respectively.</p>\n<p>Fincentrum facilitates the sale of mortgages, life insurance and investment products and boasts more than 3,000 financial advisors and a turnover in excess of €60 million. It ranks as the largest, independent distribution partner, primarily for banks and insurance companies, in the Czech and Slovak markets.</p>\n<p>The ARX exit was finalised via a 100% sale to the Swiss Life Group / <a href=\"https://www.swisslife.com/en/swisslifegroup.html\">https://www.swisslife.com/en/swisslifegroup.html</a>, a leading European provider of comprehensive life, pension and financial solutions. This acquisition strengthens Swiss Life’s presence in the region and positions the company as a clear market leader for independent financial advice in the Czech Republic and Slovakia.</p>\n<p>Michal Aron, Partner at ARX, commented: “We are pleased that the achievements of Fincentrum over the past few years have positioned the company as an attractive acquisition target for a blue-chip strategic acquirer such as Swiss Life. Fincentrum has excellent long-term growth and development prospects and we believe that Swiss Life will be an ideal driver for the business going forward.”.</p>\n<p>The divestment of Fincentrum to the publicly listed Swiss Life represents the third exit from the ARX Czech portfolio over the past 12 months to major internationally listed strategic acquirers. This series of successful exits was initiated by the sale of ARX portfolio company KVK Holding to Swiss listed Sika in Q4 2017 and was followed by the exit of VUES to NYSE listed Moog in Q2 2018. “The ARX exits achieved over the past 12 months are evidence of both the attractiveness of the Czech lower mid-cap market and the ARX investment focus as a whole. These transactions reaffirm that acquiring, developing and positioning lower mid-cap companies for exits to international strategic investors is a viable strategy for CEE”, said Brian Wardrop, ARX Managing Partner.</p>\n",
		"updatedAt": "2020-08-30T07:28:47.889Z"
	},
	{
		"perex": "<p>DC Bled has acquired the largest private healthcare provider in the Maribor area, Fontana (Medicinsko Termalni Center Fontana zdravstvo in rekreacija, d.o.o.) in March 2019, making DC Bled by far the largest private out-patient healthcare provider in Slovenia. Also, in January this year, DC Bled opened its new modern health center in Novo Mesto. These developments follow two clinic acquisitions completed in 2018. DC Bled now covers the entire country with its six clinics, over 100 employees, while serving more than 20,000 patients per annum. The company is planning additional acquisitions in 2019, led by its senior management team Lenca Moze (CFO) and Zvone Novina (CEO). All of these developments are aligned with DC Bled’s core objective to provide the highest quality medical care and service to its growing network of patients.</p>",
		"title": "DC Bled continues its expansion with the acquisition of Fontana",
		"date": "2019-03-29T00:00:00.000Z",
		"originalUrl": "https://www.arxequity.com/dc-bled-continues-its-expansion-with-the-acquisition-of-fontana/",
		"image": null,
		"body": "<p>DC Bled has acquired the largest private healthcare provider in the Maribor area, Fontana (Medicinsko Termalni Center Fontana zdravstvo in rekreacija, d.o.o.) in March 2019, making DC Bled by far the largest private out-patient healthcare provider in Slovenia. Also, in January this year, DC Bled opened its new modern health center in Novo Mesto. These developments follow two clinic acquisitions completed in 2018. DC Bled now covers the entire country with its six clinics, over 100 employees, while serving more than 20,000 patients per annum. The company is planning additional acquisitions in 2019, led by its senior management team Lenca Moze (CFO) and Zvone Novina (CEO). All of these developments are aligned with DC Bled’s core objective to provide the highest quality medical care and service to its growing network of patients.</p>\n",
		"updatedAt": "2020-08-30T07:22:17.890Z"
	},
	{
		"perex": "<p>ARX Equity Partners (“ARX”) is delighted to today announce the completion of the majority acquisition of a leading Czech-based facades business, Fenestra Wieden (“Fenestra“), and simultaneous add-on purchase of Skanska’s Czech facades operation (now collectively rebranded as Fenestra henceforth).</p>",
		"title": "ARX Equity Partners completes acquisition of two Czech facades businesses",
		"date": "2019-04-01T00:00:00.000Z",
		"originalUrl": "https://www.arxequity.com/arx-equity-partners-completes-acquisition-of-two-czech-facades-businesses/",
		"image": null,
		"body": "<p>ARX Equity Partners (“ARX”) is delighted to today announce the completion of the majority acquisition of a leading Czech-based facades business, Fenestra Wieden (“Fenestra“), and simultaneous add-on purchase of Skanska’s Czech facades operation (now collectively rebranded as Fenestra henceforth).</p>\n<p>Going forward, ARX will partner with Fenestra’s senior management, who will retain a significant minority stake as part of the deal terms. The acquisition was completed on April 1, 2019 with the deal value undisclosed.</p>\n<p>Fenestra is a producer and designer of aluminium-glass modular facade solutions serving customers throughout Europe. The newly combined Fenestra business (<a href=\"https://fenestra-wieden.cz/\">https://fenestra-wieden.cz/</a>) employs more than 200 people, operating from two production sites in the Czech Republic with annual revenue forecast at approximately € 40 million.</p>\n<p>Fenestra was founded in 1991 by Pavel Wieden, who established the business to utilise his track record and expertise in glass and aluminium construction. Fenestra is currently one of the leading Czech-based glazed-facade producers, providing complex solutions with a particular focus on design and performance for large-scale demanding projects, typically with building projects of over 10,000 sqm. Fenestra has recently completed several projects in Sweden, including the Karolinska Institute’s Ki Aula lecture hall project in Stockholm.</p>\n<p>This combination of Fenestra and the Skanska facades operation has subsequently created a significant market player showcasing deep technical and design capabilities. The strategy of combining these businesses is to capitalise on their respective specialist strengths while also maximising the potential of increased productivity and broadening geographic reach of said new direction.</p>\n",
		"updatedAt": "2020-08-30T07:28:47.787Z"
	},
	{
		"perex": "<p>ARX Equity Partners won the Central and Eastern Europe Deal of the Year Award for VUES at the 2019 Real Deals Private Equity Awards ceremony, held in London on 24 April. </p>",
		"title": "ARX Equity Partners wins the 2019 Central and Eastern Europe Deal of the Year Award",
		"date": "2019-04-25T00:00:00.000Z",
		"originalUrl": "https://www.arxequity.com/arx-equity-partners-wins-the-2019-central-and-eastern-europe-deal-of-the-year-award/",
		"image": null,
		"body": "<p>ARX Equity Partners won the Central and Eastern Europe Deal of the Year Award for VUES at the 2019 Real Deals Private Equity Awards ceremony, held in London on 24 April. </p>\n<p>The widely-renowned ceremony gathered more than 700 industry practitioners for its 18th edition to award symbols of recognition across the private equity sector. Finalists are established through research undertaken by Real Deals and Cass Business School, with support from Preqin data, then a panel of judges reviews the finalists and selects a winner.</p>\n<p>ARX acquired a majority shareholding in VUES from retiring managers in 2006, then succeeded in capitalizing on the company’s inherent technical strengths and capabilities in order to significantly grow and internationalize the business over a long-term holding period. Over the past several years VUES expanded its profit margins considerably, while simultaneously growing sales and increasing headcount. The success of VUES confirms the know-how of local engineers and competitiveness of Czech R&amp;D, which were prerequisites for the company’s expansion into increasingly demanding precision applications.</p>\n<p>The ARX investment in VUES was exited via a sale of the company to NYSE listed Moog in early 2018.</p>\n",
		"updatedAt": "2020-08-30T07:28:47.902Z"
	},
	{
		"perex": "<p>Flarna Holdings Limited, controlled by a fund managed by ARX Equity Partners  (“ARX”), has entered into a binding agreement for the sale of Anwis Sp. z o.o. <a href=\"http://www.anwis.pl\">www.anwis.pl</a> (“Anwis”) to Novaco Invest GmbH, a subsidiary of WAREMA Renkhoff SE. The transaction is subject to approval by competition protection authorities and its finalization is expected in approximately two months.</p>",
		"title": "Warema files for approval to acquire Anwis",
		"date": "2019-06-18T00:00:00.000Z",
		"originalUrl": "https://www.arxequity.com/warema-files-for-approval-to-acquire-anwis/",
		"image": null,
		"body": "<p>Flarna Holdings Limited, controlled by a fund managed by ARX Equity Partners  (“ARX”), has entered into a binding agreement for the sale of Anwis Sp. z o.o. <a href=\"http://www.anwis.pl\">www.anwis.pl</a> (“Anwis”) to Novaco Invest GmbH, a subsidiary of WAREMA Renkhoff SE. The transaction is subject to approval by competition protection authorities and its finalization is expected in approximately two months.</p>\n<p>ANWIS Sp. o.o. is a Polish manufacturer of internal and external sun shading systems founded in 1979 year. The company based in Włocławek (Poland), employs about 450 people and achieved a turnover of € 32.6 million in 2018.</p>\n<p>WAREMA Renkhoff SE <a href=\"http://www.warema.com/en/company/\">www.warema.com/en/company/</a> (“Warema”), domiciled in Marktheidenfeld in Lower Saxony, is the operative heart of and the holding company for a strong team of firms divided into two divisions: Sun &amp; Living Spaces and Plastics &amp; Engineering, with more than 3,800 employees around the world.</p>\n<p>In recent years Warema Group has accelerated the internationalization of its sun shading business and Anwis will join the Group as an independent brand.</p>\n",
		"updatedAt": "2020-08-30T07:28:47.882Z"
	},
	{
		"perex": "<p>Sava Re d.d. as buyer and Cinxro Holdings Ltd. (which is an affiliate of ARX CEE III LP) have entered into a contract under which Sava Re d.d. will acquire 80 percent of the share capital of the Slovenian company Diagnostični center Bled d.o.o. (“DC Bled”), representing 100 percent of voting rights. The completion of the transaction is subject to the fulfillment of certain suspensive conditions.</p>",
		"title": "Sava Re d.d. announces agreement to acquire Diagnostični center Bled d.o.o.",
		"date": "2019-08-08T00:00:00.000Z",
		"originalUrl": "https://www.arxequity.com/sava-re-d-d-announces-agreement-to-acquire-diagnosticni-center-bled-d-o-o/",
		"image": null,
		"body": "<p>Sava Re d.d. as buyer and Cinxro Holdings Ltd. (which is an affiliate of ARX CEE III LP) have entered into a contract under which Sava Re d.d. will acquire 80 percent of the share capital of the Slovenian company Diagnostični center Bled d.o.o. (“DC Bled”), representing 100 percent of voting rights. The completion of the transaction is subject to the fulfillment of certain suspensive conditions.</p>\n<p>The takeover of DC Bled represents an important step for the Sava Insurance Group towards implementing its strategy in the field of expansion to the market of private health services in Slovenia.</p>\n",
		"updatedAt": "2020-08-30T07:28:47.880Z"
	},
	{
		"perex": "<p>Following an approval by regulatory authorities, ARX Equity Partners (“ARX”) has completed an exit of its investment in Polish manufacturer of internal and external custom made sun shading systems Anwis Sp. z o.o. (“ANWIS”) via a sale to Novaco Invest GmbH, a subsidiary of WAREMA Renkhoff SE (“Warema”). The ARX investment into ANWIS generated an overall 3.3x cash-on-cash return multiple and an IRR of over 30%.</p>",
		"title": "ARX Equity Partners exits Anwis",
		"date": "2019-08-12T00:00:00.000Z",
		"originalUrl": "https://www.arxequity.com/arx-equity-partners-exits-anwis/",
		"image": null,
		"body": "<p>Following an approval by regulatory authorities, ARX Equity Partners (“ARX”) has completed an exit of its investment in Polish manufacturer of internal and external custom made sun shading systems Anwis Sp. z o.o. (“ANWIS”) via a sale to Novaco Invest GmbH, a subsidiary of WAREMA Renkhoff SE (“Warema”). The ARX investment into ANWIS generated an overall 3.3x cash-on-cash return multiple and an IRR of over 30%.</p>\n<p>ARX acquired a majority shareholding in ANWIS from the retiring founder in late 2014, with the intention to leverage the company’s technical capabilities, strong domestic market position, wide product range and advanced internet-based ordering solutions in order to grow and internationalize the business. This strategy positioned the company to benefit from the fast growth of the e-commerce channel in key export markets of Germany and the Netherlands. Over the past five years ANWIS retained its profit margins, while consistently growing sales and more than doubling headcount.</p>\n<p>The ANWIS investment is consistent with the ARX focus on Central European growth investments. ANWIS is a producer of custom-made window coverings and one of the leading manufacturers of window coverings and related components in Europe. The company has been operating in the region for over 40 years and has recently seen rapid growth, with sales reaching € 32.6 million in 2018, with around 50% of production exported to Western Europe. ANWIS capitalizes on its market leading position in Poland and the rapid expansion of e-commerce in Germany and the Benelux countries.</p>\n<p>The ARX exit was executed via a sale to WAREMA Renkhoff SE, a German family owned company divided into two divisions: Sun &amp; Living Spaces and Plastics &amp; Engineering, with more than 3,800 employees around the world. Warema enjoys a leading market position based on the strength of solutions it provides and innovations it develops in the sun protection segment. In both of its divisions it places importance on growing competencies incorporating innovative technologies.</p>\n",
		"updatedAt": "2020-08-30T07:28:47.875Z"
	},
	{
		"perex": "<p>ARX Equity Partners (“ARX”) completed the majority acquisition of TES Vsetin (“TES“). Headquartered in Vsetin, Czech Republic. TES (<a href=\"http://www.tes.cz\">http://www.tes.cz</a>) is an engineering company engaged primarily in the manufacturing of system components related to electrical machines, in addition to the design and manufacturing of its own proprietary electric machines, such as generators and electric motors. TES supplies critical components and machines to several blue-chip customers across various industries. The company generated revenues of over € 60 million in 2018 and currently employs around 600 technically skilled staff.</p>",
		"title": "ARX Equity Partners completes acquisition of Czech engineering business TES Vsetin",
		"date": "2019-10-16T00:00:00.000Z",
		"originalUrl": "https://www.arxequity.com/arx-equity-partners-completes-acquisition-of-czech-engineering-business-tes-vsetin-2019-10-15/",
		"image": null,
		"body": "<p>ARX Equity Partners (“ARX”) completed the majority acquisition of TES Vsetin (“TES“). Headquartered in Vsetin, Czech Republic. TES (<a href=\"http://www.tes.cz\">http://www.tes.cz</a>) is an engineering company engaged primarily in the manufacturing of system components related to electrical machines, in addition to the design and manufacturing of its own proprietary electric machines, such as generators and electric motors. TES supplies critical components and machines to several blue-chip customers across various industries. The company generated revenues of over € 60 million in 2018 and currently employs around 600 technically skilled staff.</p>\n<p>ARX acquired the business from an affiliate of Advent International. Financial details of the transaction were not disclosed. As part of the transaction, ARX has agreed to partner with the company’s existing management team, who will lead the future growth and development of the Company.</p>\n<p>TES represents the fourth investment from the ARX IV fund.</p>\n",
		"updatedAt": "2020-08-30T07:28:47.791Z"
	},
	{
		"perex": "<p>ARX Equity Partners (“ARX”), a private equity firm with a 20-year track record supporting the growth and development of mid-sized companies in Central Europe, has today completed the sale of its investment in Slovenian healthcare services provider, Diagnosticni Center Bled doo (“DCB”).</p>",
		"title": "ARX Equity Partners Exits DC Bled for 3.6x",
		"date": "2020-03-26T00:00:00.000Z",
		"originalUrl": "https://www.arxequity.com/arx-equity-partners-exits-dc-bled-for-3-6x/",
		"image": null,
		"body": "<p>ARX Equity Partners (“ARX”), a private equity firm with a 20-year track record supporting the growth and development of mid-sized companies in Central Europe, has today completed the sale of its investment in Slovenian healthcare services provider, Diagnosticni Center Bled doo (“DCB”).</p>\n<p>The divestment has generated an overall 3.6x cash-on-cash return multiple and an IRR exceeding 25%.</p>\n<p>DCB has been acquired by a joint venture involving Sava Re and Triglav, two of Slovenia’s largest insurance companies. The takeover of DC Bled represents an important step for Sava Re and Triglav respectively towards the implementation of their strategic expansion into the Slovenian private health services market.</p>\n<p>Headquartered in Bled, DCB is the largest private healthcare service provider in Slovenia. The Company provides comprehensive outpatient and inpatient medical services across six locations. DCB performs more than 20,000 specialist examinations per annum, primarily in the areas of gastroenterology, urology and MRI.</p>\n<p>ARX acquired DCB in 2015 to develop its already robust business and best-in-class, specialist medical capabilities as a platform to further consolidate and grow its market leading position in the Slovenian diagnostics sector. This objective was successfully achieved during the period of ARX ownership with four strategic add-on acquisitions completed and the company doubling in size.</p>\n<p>ARX classifies Slovenia as one if its core Central European focus markets. ARX’s track-record for the geography includes several successful Slovenian investments that have led to three profitable exits over the past decade.</p>\n",
		"updatedAt": "2020-08-30T07:28:47.817Z"
	},
	{
		"perex": "<p>ARX Equity Partners has been selected as a finalist for the second consecutive year for the Real Deals Central and Eastern Europe Deal of the Year Award for portfolio company Anwis. Last year, ARX Equity Partners won the Central and Eastern Europe Deal of the Year Award for VUES. Finalists for the Deal of the Year awards are established through research undertaken by Real Deals, in association with Cass Business School and Preqin.</p>",
		"title": "ARX Equity Partners nominated for the Central and Eastern Europe Deal of the Year Award and the Nagrody PSIK Private Equity Deal of the Year Award",
		"date": "2020-05-15T00:00:00.000Z",
		"originalUrl": "https://www.arxequity.com/arx-equity-partners-nominated-for-the-central-and-eastern-europe-deal-of-the-year-award-and-the-nagrody-psik-private-equity-deal-of-the-year-award/",
		"image": null,
		"body": "<p>ARX Equity Partners has been selected as a finalist for the second consecutive year for the Real Deals Central and Eastern Europe Deal of the Year Award for portfolio company Anwis. Last year, ARX Equity Partners won the Central and Eastern Europe Deal of the Year Award for VUES. Finalists for the Deal of the Year awards are established through research undertaken by Real Deals, in association with Cass Business School and Preqin.</p>\n<p>Additionally, ARX Equity Partners has been nominated for the Polish Private Equity Association “Nagrody PSIK” Private Equity Deal of the Year for Anwis. The aim of Nagrody PSIK is to recognize private equity and venture capital fund managers, advisors, banks and law firms for their achievements on the Polish private equity market.</p>\n<p>ARX acquired a majority shareholding in Poland-headquartered Anwis from the retiring founder in 2014, with the intention to leverage the company’s technical capabilities, strong domestic market position, wide product range and advanced internet-based ordering solutions in order to grow and internationalize the business. This strategy positioned the company to benefit from the fast growth of the e-commerce channel in key export markets of Germany and the Netherlands. Over the past five years ANWIS retained its profit margins, while consistently growing sales and more than doubling headcount. The realization of this strategy proved Anwis is one of the leading manufacturers of window coverings and related components in Europe. The ARX investment in Anwis was exited via a sale of the company to Warema Group, a leading global player in the sun protection segment, in August 2019.</p>\n",
		"updatedAt": "2020-08-30T07:28:47.911Z"
	}
]